[{"name":"2ping","desc":"a 2-way ping, able to find out if a packet was lost on the way to a 2ping server or on the way back"},{"name":"389-ds","desc":"named \"Fedora Directory Server\" before they got cold feet about the branding - see the FAQ. If you don't see the answer to the question there, it's because they're assuming you know that LDAP uses port 389"},{"name":"abcde","desc":"a better CD encoder (in the sense of \"it's a CD encoder that's better than its rivals\", not \"it makes a better CD encoder than a window manager\")"},{"name":"abiword","desc":"the word processor designed for AbiSource's AbiSuite, where \"abi(erto)\" is Spanish for \"open\""},{"name":"acme","desc":"the ACME Crossassembler for Multiple Environments"},{"name":"adequate","desc":"installed package adequacy checker; or rather, a Debian quality tester"},{"name":"aewm","desc":"an exiguous (that is, meager or scanty) window manager"},{"name":"aft","desc":"a markup tool which is almost free text"},{"name":"agave","desc":"(ex-package) a palette-coordinating tool, previously known as colorscheme; but that gave the wrong impression of its functionality, hence the switch to something completely uninformative - the agave isn't exactly renowned for its beauty, though I suppose the \"G\" might hint at a GNOME connection"},{"name":"agedu","desc":"it's \"age-du\" (as in, atime-sensitive disk-usage scanner), not \"agadoo\", but the confusion is officially tolerated"},{"name":"aisleriot","desc":"solitaire; an anagram"},{"name":"akonadi-*","desc":"KDE PIM service; the name (with a \"K\" in it) of a Ghanaian goddess (of justice and protection)"},{"name":"alacarte","desc":"previously the Simple Menu Editor for Gnome. Some may see why that was renamed; the new version is intended to convey the idea of picking things off the menu"},{"name":"aladin","desc":"(interactive sky atlas) because it uses the SIMBAD database (a Set of Identifications, Measurements and Bibliography for Astronomical Data). Spelled  French-style with one D"},{"name":"algol68g","desc":"\"Algol 68 Genie\", a compiler/interpreter for the 1968 standard (revised in 1973) for the Algorithmic Language (punning on the \"demon star\" Algol)"},{"name":"alpine","desc":"Apache-Licensed PINE, where pine was the old (non-DFSG-free) \"Program for Internet News and E-mail\" - formerly known though they say this was already a backronym as \"Pine Is Nearly Elm\", named after a yet older electronic mail program. Nowadays contains its fork realpine, which the developers insist is re-alpine (alpine development restarted, since the original team seems to not be doing much) and not real-pine…"},{"name":"amarok","desc":"(ex-package) a music player for KDE named after a Mike Oldfield album which is named in turn after an Inuit word for \"wolf\" - so definitely a \"cool animal\" (though technically isn't the Inuit word \"Amaroq\", without the all-important \"K\"?)"},{"name":"amavisd-new","desc":"now the only surviving version of \"a mail virus scanner daemon\" (how does such an uninspired name survive multiple generations of rewrites?)"},{"name":"ampache","desc":"(ex-package) (web media-server) amplifier + Apache (q.v.); you might imagine that has some connection with Winamp, but that AMP originally stood for Advanced Media Products (the MP3 player Winamp was built around)"},{"name":"anjuta","desc":"GNOME IDE named after its designer's girlfriend"},{"name":"anki","desc":"(flashcard system) Japanese for \"memorize, learn by rote\""},{"name":"anope","desc":"most IRC services daemons have classical names, and this looks like another one - it even looks vaguely as if it should be Ancient Greek for \"faceless\" - but in fact it's just the word \"epona\" backwards, since anope is based on another IRC daemon of that name (Epona being a Gaulish mare-goddess)"},{"name":"anorack","desc":"an indefinite-article validator, i.e. \"an-or-a-checker\"; it's sheer coincidence that this synonym for \"parka\" also happens to be British slang for \"nerd/trainspotter/obsessive nitpicker\""},{"name":"ansible","desc":"(software configuration management framework) nothing to do with ANSI - instead it's named after a science-fictional instantaneous communications device.  (The developer who named the software originally attributed the term to the author Orson Scott Card, but Card was borrowing it from Ursula K Le Guin.)"},{"name":"ant","desc":"Apache's Java build tool; an appropriate animal justified as \"another neat tool\""},{"name":"anthy","desc":"(Japanese character-convertor), named after Anthy Himemiya, a character from the anime \"Revolutionary Girl Utena\" but not the kind of character that regularly converts"},{"name":"aodh-*","desc":"(OpenStack alarm service, forked out of ceilometer) an Irish name pronounced just like the letter \"A\" and meaning \"fire\" - see also heat"},{"name":"apache","desc":"legendarily a pun on “A Patchy Server”, since it started as a collection of patches to the NCSA httpd; but the current official version is that it's named after the Apache tribe of Native Americans, who were skilled in warfare. One of the creators of Apache, Brian Behlendorf, came up with the name out of the blue – he liked the connotations of aggressiveness.  Mind you, BB was one of the ones who spent the nineties handing out the \"patchy\" version..."},{"name":"apt","desc":"\"APT\" was originally announced as simply \"a package tool\"; these days people seem to prefer either advanced package tool or (the slightly less apt alternative) advanced packaging tool, but none of these answers are officially official"},{"name":"arandr","desc":"another XRandR client, because there were already clients called XRandR, GRandR, URandR, and LXRandR by the time it was created. XRandR itself stands for \"X resize and rotate\""},{"name":"ardour","desc":"(\"digital audio workstation\") so called for a whole collection of reasons"},{"name":"argonaut-*","desc":"(server-client distributed deployment infrastructure) for some of the package descriptions in the suite this name is a groan-inducingly obvious Greek-mythology pun, but others don't even mention that its message protocol is encoded in JavaScript Object Notation"},{"name":"argyll","desc":"(color calibration manager) apparently named after the street the developer lived on, which is in turn (maybe fortuitously) named after a region of Scotland associated with tartans (which are basically standardized colorschemes - not to be confused with the Argyle pattern mostly seen on garishly colored golf outfits)"},{"name":"aseba","desc":"(classroom robot control system) apparently a reference to the Achenbach System of Empirically Based Assessment used in child psychology"},{"name":"asmix","desc":"a dockable mixer (that is, a volume control knob) originally designed for the afterstep window-manager (compare gnustep), as were a good few other nineties packages with names beginning with \"A\" or especially \"AS\"; many of them were later replaced by \"WM\" versions for windowmaker"},{"name":"asp","desc":"(dynamic-IP-address discovery tool) address search protocol"},{"name":"aspell","desc":"(spell checker) designed to replace ispell, in particular in -a (auto?) mode or maybe it's a spell checker with an advanced adaptive advisory approximation algorithm, unless it was just an apparently arbitrary available alphanumeric"},{"name":"asterisk","desc":"(PBX) \"The name 'Asterisk' was chosen because it was both a key on a standard telephone and also the wildcard symbol\""},{"name":"atomicparsley","desc":"(MPEG-4 metadata editor) \"atoms\" are the building blocks of MPEG-4 container units, and \"parsley\" is a reference to garnishing files with extra information and/or a pun on \"parser\""},{"name":"atril","desc":"(evince fork for MATE, thematically named in Spanish) \"lectern\" - i.e. a thing for reading from"},{"name":"auctex","desc":"a TeX-editing environment for Emacs developed at what was then the Aalborg University Center, Denmark"},{"name":"audacious","desc":"player punning on \"audio\", not to be confused with audacity. BMP (Beep Media Player, originally just called Beep) was a fork of XMMS (see xmms2), and Audacious in turn is a fork of BMP; somewhere along the way it stopped being a WinAmp clone"},{"name":"audacity","desc":"audio editor with a punning name - compare timidity"},{"name":"augeas-tools","desc":"(CLI configuration-file management utilities) in Greek myth, King Augeas was the one who didn't clean out the legendarily filthy Augean Stables - indeed, he even tried to cheat Hercules out of the reward for successfully doing so. You can guess how well that ended"},{"name":"autopoint","desc":"a build tool for a source package's GNU gettext localization infrastructure; that is, it automates setting up the required po/, intl/, and m4/ directories (cf. po-debconf)"},{"name":"avahi-*","desc":"(zeroconf implementation) the obscure animal name struck a developer as cool"},{"name":"awk","desc":"(virtual package) see mawk"},{"name":"ayatana-*","desc":"a piece of Buddhist philosophical jargon usually translated \"sense base\" something we ought to be trying not to get hung up on, which makes it an odd name for a project to develop a pretty UI"},{"name":"ayttm","desc":"(ex-package) (IM client) originally YATTM (Yet Another Typical Text Messager? You All Talk Too Much?) but misspelled when the project-name was registered; since backronymed as \"are you talking to me?\""},{"name":"azureus","desc":"(ex-package) (BitTorrent client) named after the genus of \"azure-colored\" poison-dart frog in its logo (Upstream have rebranded as \"Vuze\", but that's a GPL app with a clickthrough EULA...)"},{"name":"bacula","desc":"I suppose you could argue that it comes out at night and sucks your company's lifeblood over the network, but it really is just an excruciating pun on backups and Dracula (slightly excused by the spin-off acronym of the Bacula Admin Tool)"},{"name":"baloo*","desc":"(KDE metadata search framework replacing libnepomuk) given that this is the successor to basenji and before that beagle, both named after breeds of hunting dog, maybe it's because \"Baloo\" is popular as a name for individual hounds? But whether directly or indirectly, it comes from the name of the bear in \"Jungle Book\", which Kipling took from the Hindi word for \"bear\", bhaalu"},{"name":"balsa","desc":"a GNOME mailclient, named in the tradition of pine and elm (see alpine)"},{"name":"bangarang","desc":"(ex-package) (KDE media player) Jamaican slang for hubbub, uproar"},{"name":"banshee","desc":"(ex-package) (GNOME media management application) originally \"Sonance\", but renamed after a supernatural entity that produces ill-omened keening (because apparently that's what people want out of their PCs these days... wait, a music app based on Mono and it didn't get called Stereo?)"},{"name":"barrier","desc":"(free fork of Synergy) a mechanism to let machines share mouse/keyboard, named backwards for the thing it eliminates"},{"name":"baobab","desc":"(the GNOME Disk Usage Analyzer) a bloaty tree"},{"name":"barbican-*","desc":"(OpenStack key management service) named after the gatehouse in the outer wall of a castle"},{"name":"bc","desc":"originally a front-end for dc (\"desk-calculator\"); modern GNU bc is instead a backwards-compatible byte-code interpreter for dc, but what it stands for is still \"basic calculator\""},{"name":"biff","desc":"traditional UNIX mail notification tool named after somebody's dog"},{"name":"bind9","desc":"yes, it stands for \"Berkeley Internet name domain (version nine)\", but what's a \"name domain\" (as opposed to a domain name)? The original unabbreviated name was \"the Berkeley Internet Name Domain Server\" - that is, it was the UCB domain-server for Internet-names."},{"name":"bins","desc":"(ex-package) (photo album generator) anyone remember SWIGS, Structured Web Image Gallery System? BINS is not SWIGS"},{"name":"biomaj","desc":"(ex-package) a biological database updater; for francophones it's obvious that mise-à-jour means \"update\""},{"name":"bison","desc":"a pun on yacc"},{"name":"bitlbee","desc":"(IRC/IM gateway) Anglo-Dutch gibberish"},{"name":"black","desc":"a Python code formatter that works on the Ford principle \"Any color you like as long as it's black\""},{"name":"blender","desc":"(3D animator) not directly named after the kitchen appliance; it was a song (by Yello) used as backing music for a demo of an earlier incarnation"},{"name":"bluefish","desc":"(HTML editor) named after its logo (not the same blue fish as its current logo)"},{"name":"bluez","desc":"(tools for using shortrange Bluetooth wireless devices) upstream write it as BlueZ, implying it's \"bloo-zee\" rather than just \"blooz\"; the significance of the Z is unclear, but the rest is easy. The protocol is named after the 10th-century Danish king Harald \"Blåtand\" Gormsson, who was (supposedly) skilled at fostering cooperation between diverse factions, and (maybe) overfond of blueberries (Then again there are also rumours that early prototype receivers were blue and tooth-shaped)"},{"name":"bochs","desc":"(classic x86 PC emulator) claims to be a play on the word \"box\", but unless there's a pun I'm not seeing it's just a whimsical misspelling"},{"name":"bonnie++","desc":"this package's description passes the buck to bonnie, which (when last seen, in Potato) had the description \"a file system benchmark which attempts to study bottlenecks - it is named 'Bonnie' for semi-obvious reasons.\" Don't get it? The reason is that blues/country musician Bonnie Raitt plays slide guitar using a bottleneck."},{"name":"borgbackup","desc":"a backup framework forked from Jonas Borgström's attic by a group of developers going by the name \"the Borg Collective\" whatever the reason for this name I'm sure it can't have been any sort of reference to Paramount's intellectual property"},{"name":"brasero","desc":"(CD-burner) from the Spanish for \"heater\" - i.e. a burner"},{"name":"bro","desc":"(network sniffer) decades ago this was short for an Orwellian Big Brother; since then the word has picked up unwelcome connotations, so upstream has switched to zeek, a Gary Larson reference"},{"name":"brotli","desc":"a compression tool named after a Swiss bakery product (cf.zopfli); in this case Brötli (or Brödli) = \"little bread, bun\""},{"name":"brz","desc":"brz=breezy is a fork of bzr=bazaar"},{"name":"bsd*","desc":"a few packages have names beginning with BSD not to indicate that they are specific to the Debian GNU/kFreeBSD ports but to signal that Linux distros originally inherited them from (the earliest clearly free versions of) the Berkeley Software Distribution"},{"name":"bsd-mailx","desc":"an example of the above; this is a BSD-derived replacement for the original UNIX mail command. The names of different versions have a tangled history (and even that link doesn't directly explain the \"X\"; presumably it's for \"extended\")"},{"name":"bsdowl","desc":"a BSD make tool \"dedicated to Pallas Athene\" in reference to the Max-Planck Gesellschaft (but nothing to do with Project Athena) Also, French users would pronounce it bestiole which could be translated back to beastie, which is the nickname of the BSD daemon."},{"name":"btrfs-progs","desc":"(formerly btrfs-tools) BTRFS is the B-tree File System, but if that abbreviation didn't suggest \"BetterFS\" there would be no reason to include the \"R\" (ReiserFS meanwhile is probably better off not mentioning Hans Reiser)"},{"name":"buffy","desc":"(new-mail summarizer - see also xbuffy, etc.) a spin-off from biff, because before she got her own TV show Buffy was the girlfriend of the mythical eighties newbie USENET poster BIFF@BIT.NET."},{"name":"bugzilla*","desc":"originally the bugtracking tool used by Netscape for Mozilla, Chatzilla, etc, so the -zilla part isn't intended to carry its usual negative connotations (\"huge, monstrous, and uncontrollably destructive\")"},{"name":"bumblebee","desc":"software to support NVIDIA Optimus hardware, thematically named after a \"Transformers\" character"},{"name":"burrow","desc":"a performance monitor for Kafka named after an unfinished short story"},{"name":"butteraugli","desc":"another image-compression tool from Google with a name from Swiss pastry-making (literally \"(little-)butter-eye\")"},{"name":"byobu","desc":"a command line \"window manager\" built on  tmux/GNU Screen, named from the Japanese word (byōbu) for a screen (in the folding-panel room-divider sense)"},{"name":"caca-utils","desc":"libcaca pretends to be an acronym for \"Color AsCii Art\", but really it's self-deprecating code: \"caca\" means \"poo\" in French.  As the website explains (via a quote in French), \"everything useful is ugly\""},{"name":"cairo*","desc":"the Cairo graphics library was originally named Xr (\"X11 rendering\"?), then renamed as something less platform-specific: \"Cairo\" sounds like chi-rho, which is vaguely equivalent to Xr"},{"name":"caja","desc":"(nautilus fork for MATE, thematically named in Spanish) \"case/chest/countertop\" (pronounced to rhyme with \"baja\")"},{"name":"calibre","desc":"(manager for e-book catalogs, or maybe with that un-American spelling it should be catalogues) that's \"libre\" as in liberté, not (just) libr- as in library"},{"name":"calligra","desc":"(formerly known as KOffice) just a brandname suggesting \"calligraphy\" and mysteriously lacking a \"K\""},{"name":"canto","desc":"(ex-package) (text Atom/RSS feedreader) looks like a Console Atom News-something, but apparently it's just because it has a subdivided UI and a canto is a subdivision of a poem"},{"name":"caspar","desc":"(make-based CMS) the man page used to explain that it was \"named after Caspar the Friendly Ghost, since that's the title of the Daniel Johnston song I was listening to\""},{"name":"cclive","desc":"successor for clive written in C. clive must have been a command-line-interface video-extractor (because it certainly wasn't a Virtual Environment written in the .NET Common Language Infrastructure)"},{"name":"ceilometer-*","desc":"(OpenStack metering service) named after an instrument for measuring cloud coverage"},{"name":"ceph","desc":"(OpenStack storage) short for \"cephalopod\", though not for any reason you'd be likely to guess; supposedly it's a reference to parallelization and/or a university's mollusc mascot"},{"name":"chafa","desc":"another self-deprecating name for a (non-ASCII) \"ASCII art\" package; New-World Spanish for \"shoddy\""},{"name":"charliecloud","desc":"the boss was named Charles"},{"name":"chicken-*","desc":"a scheme compiler; the name was inspired by a toy chicken  (or actually an evil penguin disguised as a chicken)"},{"name":"chimera2","desc":"(ex-package) a remarkable number of web browsers have used this name, including the OS X one that was better known as Camino; this one's much older (and yet still only claims to be an alpha release). Its use of the Athena widget set explains the classical connection; otherwise like most of its namesakes it's probably advertising itself as a monstrous hybrid"},{"name":"chocolate-doom","desc":"(contrib) a pun on \"Vanilla Doom\", a common term used within the Doom gaming community to refer to the original doom.exe on MS-DOS. Chocolate Doom aims to emulate it as closely as possible"},{"name":"choqok","desc":"a KDE (hence often written \"choqoK\") microblogging client \"named from an ancient Persian word for sparrow\" (that's چغوک, pronounced [tʃʊˈqʊk], apparently Khorasan dialect; but Old Persian had no /q/, so where did that come from?)"},{"name":"chromium","desc":"web browsers on Linux spent a decade going through a cycle of slick new slimline web browsers gradually getting buried in creeping features until they were as weighed down with chrome grills and ornamental fins as a fifties US car, at which point everyone would switch to some new minimalist alternative. Meanwhile these GUI widgets came to be referred to as \"chrome\", which explains why Google would choose to advertise their browser as if it was manufactured entirely out of deadweight bling..."},{"name":"chuck","desc":"(\"Audio Programming Language\") built around a dataflow \"chuck\" operator - the language name is written \"ChucK\", but that just seems to be because related software had similar capitalization"},{"name":"cinder-*","desc":"(OpenStack block-storage service) as in \"cinderblock\" if only they'd gone for en_GB it could have been \"breeze(block)\"!"},{"name":"cinnamon","desc":"Linux Mint's fork of gnome-shell; seemingly a thematic flavorsome name - cf. mate were they perhaps particularly thinking of things like Cinnamon Altoids?"},{"name":"clevis","desc":"encryption framework named after a type of shackle fastener"},{"name":"clisp","desc":"Common Lisp, originally a list-processing language"},{"name":"clojure","desc":"(JVM Lisp variant) the word includes the letters C (for C/C#), L (Lisp), and J (Java), puns on \"closure\", and was a free domainname"},{"name":"conkeror","desc":"(ex-package) (web browser) a pun on konqueror and a reference to a novelty beer, but basically a word for the winner in the traditional British children's game of conkers"},{"name":"conky-*","desc":"(contrib) system monitor; named after an evil dummy character in the Canadian mockumentary TV series \"Trailer Park Boys\""},{"name":"coreutils","desc":"the package itself has a clear name, but its contents include many commands named in shorthand: dd: on IBM system/360 mainframes, the Job Control Language used a dd-like syntax to create a Dataset Definition.  Legend has it that \"Copy and Convert\" would have been cc, but that was already the C compiler; dd was the next-best thing (alphabetically). Some users prefer \"data/disk destroyer\" or \"delete data\", which, thanks to its non-unix-y interface, is what the user may end up actually doing when trying to duplicate data or disks. mknod: originally created any sort of \"file system node\"; nowadays of extremely limited usefulness. ptx: an inscrutable abbreviation for a word-salad generator. PermuTed indeXes were tortuous concordances for manual pages back in the days before tools like apropos. The GNU version was created in 1999 as some sort of exercise in medieval reenactment. uname: short for \"UNIX name\", which makes it bizarre that the version now standard comes from a project that's explicitly Not UNIX..."},{"name":"corosync","desc":"(cluster interprocess messaging framework) I'm really hoping this is coro as in the Portuguese/Spanish/Italian for \"chorus\" (or conceivably \"coroutine\"), plus sync as in \"(virtual) synchrony\", and has nothing to do with coronary syncopation a.k.a. cardiac arrhythmia"},{"name":"cortina","desc":"(GNOME wallpaper app) Italian for \"curtain\" (and an old rustbucket brand of car which is a UK cultural icon)"},{"name":"cowpatty","desc":"(wifi brute-forcer) a word that contains -WPA-"},{"name":"cpio","desc":"the archiving tool does indeed \"copy in/out\", but this package also includes an executable that's harder to guess the function of: \"mt-gnu\", the GNU version of the magnetic tape manipulation tool"},{"name":"cricket","desc":"\"I called it Cricket because it popped into mind. It's short and catchy, and there seems to be no other piece of network management software called Cricket\". The logo clarifies that it's referencing the chirpy insect, not the game"},{"name":"crm114","desc":"a reference to Dr Strangelove (where an oversensitive CRM114 Discriminator causes the nuclear apocalypse) partly justified by the backronym \"controllable regex mutilator\""},{"name":"curl","desc":"the FAQ says it's \"a play on 'Client for URLs', originally with URL spelled in uppercase to make it obvious it deals with URLs. The fact it can also be pronounced 'see URL' also helped, it works as an abbreviation for 'Client URL Request Library' or why not the recursive version: 'Curl URL Request Library'\""},{"name":"cw","desc":"a front-end to the Morse processor unixcw. \"CW\" originally stood for \"continuous wave radio\", but hams use it as (written) shorthand for \"Morse\" regardless of the medium"},{"name":"cwm","desc":"(window manager inspired by evilwm) also known as calmwm"},{"name":"cyrus-*","desc":"mail server; named in honor of King Cyrus II (\"the Great\") of Persia, who established an early postal network (why has this page ended up with so many Persian references?)"},{"name":"dansguardian","desc":"Daniel Barron's web-censoring server, which \"guards\" web users from the things it's filtering"},{"name":"daphne","desc":"(server for Django Channels) named after a Django Reinhardt composition"},{"name":"darcs","desc":"the package description seems to imply it stands for Distributed Interactive Revision Control System, which of course it doesn't; the D was originally for \"David (Roundy)'s\", but he preferred the recursive Darcs Advanced RCS"},{"name":"dares","desc":"recovery tool for damaged optical discs; for some reason only the German docs admit it's short for data-rescue"},{"name":"dbus","desc":"yes, it's a \"message bus\", but what's that when it's at home? The answer is that it's a data transport system - a standard software engineering technical term coined by analogy with hardware \"buses\" such as PCI, which are themselves named after electrical-engineering \"busbars\", which got their name in the days when the omnibus was the latest in transport technology. Third-generation jargon! Meanwhile, although it's nowhere to be seen in the official docs, Wikipedia claims the \"D\" stands for Desktop.  See also the input-method framework ibus, where the connection to the original vehicular metaphor is even more tenuous"},{"name":"dconf-*","desc":"a replacement for GConf (the GNOME Configurator), where the \"D\" may stand for D-Bus or directly for \"Desktop\"; not connected to the ex-package \"dconf\" where it was D for Dump, or maybe Distributed"},{"name":"denemo","desc":"GUI for lilypond, the music typesetting system. denemo is a garbled version of the word \"dénouement\" (compare the commercial alternative \"Finale\"). The name lilypond itself references the slightly earlier rosegarden and a friend named Suzanne (etymologically \"lily\")"},{"name":"designate","desc":"(OpenStack DNS-as-a-Service) a synonym for (the verb) \"name\""},{"name":"desmume","desc":"(Nintendo DS emulator) an odd garbling of \"DS-emu-Me\", in the style of \"hacking\" tools like FlashMe  (meanwhile, \"DS\" was originally \"Developer System\")"},{"name":"dillo","desc":"an earlier web browser was named \"gzilla\" (a GTK mini-Mozilla), then since that was just too close, \"armadillo\"; this fork is a cut-down version"},{"name":"ding","desc":"allegedly dictionary nice grep, but note that \"Ding\" is the German for \"thing/thingummy\""},{"name":"diodon","desc":"(GNOME clipboard manager) another arbitrary(?) animal: Diodon is a genus of blowfish (named from Greek \"two-tooth\")"},{"name":"dirvish","desc":"(backup system) because it writes to spinning media - like external SSDs instead of tape spools... uh, hang on a minute.  And aren't whirling dervishes spelled with an E?  So maybe the acronym theory makes more sense after all"},{"name":"*django","desc":"(Python web-app development framework) named after jazz guitarist Django Reinhardt, the famous  Belgian (whose (nick)name means \"I awake\" in Romani)"},{"name":"dolphin","desc":"(KDE file manager) a not-quite-arbitrary cool animal, in that it's smart and streamlined (and compare GNOME's equivalent, nautilus)"},{"name":"doxygen","desc":"got its name from playing with the words \"documentation\" and \"generator\" (documentation → docs → dox, and generator → gen). At the time the author was looking into lex and yacc, where a lot of things start with \"yy\", so the \"Y\" slipped in and made things pronounceable (Makes me think of Doxies in Harry Potter, which are a nameplay on toxic; even more so as automatically generated \"documentation\" is often toxic to real documentation. -- Except that doxygen was named before doxies appeared in the HP videogames, and centuries after the word doxy appeared in English!)"},{"name":"dracut","desc":"(low-level tool for generating initramfs images) a small town in Massachusetts, not all that far from Plymouth"},{"name":"drupal*","desc":"(ex-package) PHP blog engine; mangled Dutch for \"droplet\", named after the (former) online community at drop.org, which in turn was originally a typo for \"dorp\", village (so it's double Dutch)"},{"name":"dune","desc":"(OCaml builder) camel-themed SF reference"},{"name":"dunst","desc":"dmenu-ish universal notification system (and German for \"haze\", or maybe even a reference to the actress Kirsten Dunst); dmenu is the Dynamic menu app included in suckless-tools"},{"name":"dynamite","desc":"it \"blows up\" (meaning \"inflates\", meaning decompresses) PKWARE (i.e. .zip) archives (was the word \"unzip\" patented or something?)"},{"name":"eclipse","desc":"(Java IDE) the Eclipse Foundation may be essentially a project to support Java development in a Sunless environment, but when it was named the thing it was intended to eclipse was MS Visual Studio - the snub to Sun Microsystems is an accident! (Sun itself being named after the Stanford University Network)"},{"name":"eiciel","desc":"(GNOME ACL-editor) a spelling in phonetic Spanish of the English initialism for \"Access Control Lists\" Technically when you edit those lists you're changing actual individual Access Control Entities, but oddly nobody ever talks about ACEs"},{"name":"ekiga","desc":"(ex-package) VoIP client formerly known as GnomeMeeting; from a Cameroonian communications mechanism rather like \"talking drums\" minus the drums"},{"name":"elk","desc":"the extension language kit - an implementation of Scheme (cf. guile), and yet another free software ungulate"},{"name":"elpa-*","desc":"software from the Emacs Lisp package archive"},{"name":"emacs*","desc":"originally a set of Editor MACroS for the TECO editor; see also xemacs"},{"name":"emesene","desc":"(ex-package) obviously something to do with the MSN protocol; less obviously just the initialism spelled out in Spanish"},{"name":"enchant","desc":"a wrapper for spellchecking systems named as a pun on \"spelling\""},{"name":"engrampa","desc":"(file-roller fork for MATE, thematically named in Spanish) staple/bind/clip together"},{"name":"epic5","desc":"enhanced programmable IRC-II client (version five)"},{"name":"epiphany-*","desc":"GNOME web browser; the word means \"a moment of insight or (mystical) revelation\", so maybe it's just a fancy way of saying \"it's an idea I had\" (but meanwhile it's being renamed web, which is obvious to the point of namehoggery)"},{"name":"eric","desc":"an IDE for Python overtly named after Monty Python's Eric Idle (compare idle)"},{"name":"erlang","desc":"a programming language either named after a Danish mathematician/engineer or after the fact it's a language originally developed by Ericsson (for telephony)"},{"name":"etherape","desc":"a packetsniffer punningly named after the Windows-only EtherMan, where \"Man\" was short for man-in-the-middle. Not connected to \"the Ether Man\", the media nickname for a serial rapist"},{"name":"ettercap","desc":"an ethernet capture tool; it's also a lurking horror capable of ARP poisoning, so it's named after a venomous AD&D spider-monster"},{"name":"evince","desc":"(document viewer) swanky word for \"show\""},{"name":"evolution","desc":"(GNOME groupware) inherited from Ximian, where it fits in with their primatological theme (cue joke about the majority of Americans not believing in it and the rest not understanding it)"},{"name":"exfalso","desc":"tag editor for quodlibet. \"Ex falso quod libet\" is Latin for \"from a falsehood, whatever you please\" (a principle of classical logic)"},{"name":"exim4","desc":"version four of an MTA that was originally an EXperimental Internet Mailer"},{"name":"exo-utils","desc":"the libexo support library for Xfce applications consists of extensions developed by os-cillation.de"},{"name":"expat","desc":"the expat XML parser is so called because it's an English word that's close enough to X-pa(mumble)"},{"name":"eyes17","desc":"Experiments for Young Engineers and Scientists"},{"name":"fcitx","desc":"originally the free Chinese input toy for X; but that was never a very good name and has become increasingly inaccurate, so we are now permitted to understand it as standing for anything we like, such as maybe \"friendly customizable interaction tool for UNIX\", or maybe \"flexible character indication technology for... xenography\""},{"name":"feersum","desc":"(PSGI engine) a reference to the Iain M. Banks novel \"Feersum Enjinn\" (\"fearsome engine\")"},{"name":"fenics","desc":"the FEniCS project provides computational software for finite element analysis, originally compiled at the University of Chicago (whose emblem is a phoenix)"},{"name":"ffmpeg","desc":"(media player) \"FF\" as in Fast-Forward, MPEG as in the media format established by the Moving Picture Experts Group"},{"name":"fgetty","desc":"Felix von Leitner's getty"},{"name":"figlet","desc":"Frank, Ian, & Glenn's letters. Named by the original author for (1) a friend whose e-mail signature inspired the program, (2) another friend who contributed some code, and (3) himself"},{"name":"file-roller","desc":"GNOME archive manager; the association with compression implies that it was named in the part of the anglophone world where people talk about \"(road-)rollers\" rather than always calling them \"steamrollers\""},{"name":"firefox","desc":"(mozilla-descended webbrowser) originally announced as Phoenix, then since there was already a trademarked browser by that name, Firebird... which it turned out was also taken. Their third pick was a literal translation of the Chinese name for Ailurus fulgens, the red (lesser) panda. Pay no attention to that logo, it's more closely related to seals than to foxes, and closer to skunks than to giant pandas. Then it spent a decade in Debian under yet another name"},{"name":"flite","desc":"\"festival lite\", because it's a lightweight alternative to the Festival Speech Synthesis System (originally developed at the University of Edinburgh)"},{"name":"fop","desc":"(XML converter) formatting objects processor"},{"name":"forg","desc":"a Python-TK gopher client confusingly named as a Kermit reference - see the old explanation on its homepage. The gopher protocol itself got its name from the mascot of the University of Minnesota, and from the fact it runs file-fetching errands through a network of virtual tunnels."},{"name":"fort77","desc":"a front-end to invoke The IBM Mathematical FORmula TRANslating System, as standardized in the seventies (arguably 1978!)"},{"name":"fpc","desc":"(the Free Pascal Compiler) \"Free Pascal\" is the particular free Pascal derived from FPK Pascal (named with its author's initials), and the language was named after the inventor of the mechanical calculator."},{"name":"*fribidi*","desc":"GNU FriBiDi is a free implementation of the Unicode Bi-directional Algorithm, to support writing systems like Hebrew and Arabic (which require both right-to-left and occasionally left-to-right text). Giving it the same vowel throughout may be to make it simpler for non-anglophones, or just funnier not to be confused with fribid, ITP #578563"},{"name":"fuse*","desc":"some of these packages are more up-front than others about the fact it stands for filesystem-in-userspace, which is not so much an acronym as a pair of jargon terms smushed together. Maybe it would have been called u-mount if that wasn't already taken"},{"name":"futatabi","desc":"(video server) Japanese for \"again\", because it does replays etc"},{"name":"fvwm","desc":"nobody knows what the \"F\" stands for, but the most popular arbitrary retrofit is that it's the \"feline\" virtual window manager"},{"name":"g10k","desc":"(Puppet environment and module deployment) no, it's not short for \"gobbledigook\", it's just a Go rewrite of r10k"},{"name":"gajim","desc":"Gajim's A Jabber Instant Messenger (not to be confused with gaim - see pidgin)"},{"name":"gambas3","desc":"(BASIC IDE) GAMBAS is a recursive acronym for \"GAMBAS almost means BASIC\", as well as being Spanish/Portuguese for \"prawns\" (hence the logo)"},{"name":"gamin","desc":"francophone wordplay: first there was the File Alteration Monitor, then (because \"fam\" is short for \"family\") its child projects were called \"marmot\" and \"gamin\" (both of which mean something like \"kid\", \"brat\")"},{"name":"ganeti","desc":"(VM-clusterizer) the FAQ has vanished, but apparently it's a distinctive nonsense-word"},{"name":"gawk","desc":"GNU AWK - see mawk"},{"name":"gazebo*","desc":"(robotics simulator) the next best thing to testing them outdoors"},{"name":"gcompris","desc":"(educational games) another French pun: \"G Compris\" = \"j'ai compris\" = \"I understand (have understood)\""},{"name":"gcp","desc":"stands for Goffi's file CoPier, Goffi being the nickname of the author"},{"name":"geany","desc":"(GTK IDE) something along the lines of Gtk-anythingyoulike, with the E just nudging it in the direction of \"genie\" (or judging by the FAQ's pronunciation guide, French \"génie\")"},{"name":"geeqie","desc":"a fork of gqview (punning on \"geeky\") (but why \"GQview\" in the first place? Was it an app for reading GQ magazine??)"},{"name":"gforth","desc":"GNU Forth, which would have been named FOURTH if IBM 1130s allowed six-letter names, since it claimed to be fourth-generation software (though not a 4GL in the later sense)"},{"name":"ghostscript","desc":"a punning name for a GPLed alternative to Adobe PostScript"},{"name":"gigolo","desc":"a GIO/GVfs filesystem connection manager, named this way because as a gigolo, it mounts what it is told to"},{"name":"gir*","desc":"GIR is the GObject introspection repository; \"type introspection\" lets objects provide metadata about themselves, but the main influence on this name is probably the fact that \"Gir\" is an Invader Zim reference"},{"name":"git","desc":"(distributed VCS) semi-arbitrary short word"},{"name":"gitalist","desc":"(ex-package) web viewer for git based on Catalyst"},{"name":"gkermit","desc":"GPLed client for the kermit protocol, which was named after the muppet but backronymed as \"Kl10 Errorfree Reciprocal Microprocessor Interchange over TTY\" a free kermit? should have been \"permit\""},{"name":"gkrellm","desc":"according to the vanished FAQ, it's short for GNU (or GTK) Krell Monitors (or meters), the Krell being the alien species featured in the movie \"Forbidden Planet\""},{"name":"glance","desc":"(OpenStack image service) a name associated with speed and the visual sense of the word \"image\""},{"name":"glewlwyd","desc":"(OAuth2 authentication server) in Welsh legend, King Arthur's gatekeeper"},{"name":"*glib*","desc":"named after the non-GUI-specific code separated out from GTK+, where the G as usual stands indirectly for GNU; not to be confused with glibc AKA eglibc AKA libc6"},{"name":"glymur-*","desc":"(JPEG2000 tools) named after a waterfall in Iceland. presumably as a (web media) \"streaming\" reference"},{"name":"gnat","desc":"(the GCC Ada compiler) originally the GNU NYU (New York University) Ada(95) Translator (Ada being named in honor of \"the first computer programmer\", Ada Lovelace)"},{"name":"gnats","desc":"(bug-tracker) not to be confused with the above: gnats are just GNU-themed bugs (or insects at any rate)"},{"name":"gnocchi-*","desc":"(OpenStack Metering-as-a-Service) a thematic-naming pun on the OpenStack message queue called Marconi (deliberately confusing that with \"macaroni\") - see zaqar"},{"name":"gnome","desc":"originally the GNU Network Object Model Environment, (was the reference to gnomes perhaps also a play on the fact that KDE depended on the non-DFSG-free Qt framework produced by Trolltech?) until that was judged not to match the project's objectives; now it doesn't stand for anything (and in particular there is no truth at all to the rumor that it now stands for \"Gradually Narrowing Options Maximize Exasperation\")"},{"name":"gnome-klotski","desc":"a GNOME sliding block puzzle; from the Polish \"klocki\", \"wooden blocks\", and formerly known even more obscurely as gnotski"},{"name":"gnome-orca","desc":"as the FAQ used to explain, named in the same tradition as previous screen-readers such as Flipper and Dolphin"},{"name":"gnome-sushi","desc":"previewer for nautilus; presumably the idea is that you're eating raw cephalopod. (Strictly speaking sushi is a kind of rice, traditionally accompanied with seafood using a preparation method that takes a lot longer than simply cooking it) Not to be confused with the sushi which is a metapackage for a thematically named IRC suite though both sushis make a big deal of their dbus integration"},{"name":"gnome-tetravex","desc":"a vexing GNOME puzzle played on a 4×4 grid; formerly known even more obscurely as gnotravex"},{"name":"gnumach","desc":"(not to be confused with mach) GNU implementation of the MACH microkernel, which was originally jokingly named MUCK - \"multi-user (or multiprocessor universal) communication kernel\" - until it was misspelled by an Italian"},{"name":"gnuplot","desc":"a graphing tool, but one that has absolutely nothing to do with GNU: \"gnu\" was just an arbitrary animal name that sounds like \"new\""},{"name":"gnustep-*","desc":"a GUI programming environment descended from NeXTStep (which came from NeXT Software, Inc.); meanwhile macOS is derived from OpenStep (and no, there's no Microsoft GooseStep)"},{"name":"gobby","desc":"(GNOME collaborative editor) originally built around a library called libobby (linked with -lobby); the GUI was therefore named g-obby"},{"name":"golang","desc":"(not an i18n package for goplay, or even connected to Google's Go-playing machine, which is mostly in C++) Google's Go programming language, which they seem to have given the shortest name they could find that was (a) cool and (b) Google-related"},{"name":"gprolog","desc":"the GNU compiler for Prolog, which was so called as an abbreviation in French for \"programmation en logique\" (logic programming)"},{"name":"grace","desc":"descended from xmgr (the X Motif GRapher) which was also for no obvious reason known as ACE/gr"},{"name":"grep","desc":"Global Regular Expression Print"},{"name":"grim","desc":"(Wayland screenshotter) grab image"},{"name":"groff","desc":"the GNU replacement for the text formatters troff (typesetter roff) and nroff (\"new\" as of 1979); \"roff\" is a contraction of \"run-off\" as in \"run off a hard copy\""},{"name":"gromacs","desc":"(Molecular Dynamics computation system) nothing to do with groff or emacs; it's the Groningen (NL) machine for chemical simulation"},{"name":"gross","desc":"mailserver for graylisting of suspicious sources"},{"name":"guacamole","desc":"(web VNC system) arbitrary word and near-miss for a cool animal name"},{"name":"gudhi-utils","desc":"\"Geometry Understanding In Higher Dimensions\", folded through hyperspace into GUDHI as in the Marathi \"guḍhī pāḍavā\" festival"},{"name":"guetzli","desc":"a (JPEG) compression tool named after a Swiss bakery product (cf. zopfli); in this case biscuits"},{"name":"guile-*","desc":"backronymed as the GNU Ubiquitous Intelligent Language for Extensions, but mainly a pun; it's an interpreter/virtual machine for the language \"scheme\", which was originally named \"schemer\", in the tradition of lisp-derivatives like \"planner\" and \"conniver\""},{"name":"gummiboot","desc":"(ex-package) (UEFI bootloader) a German pun (cf. u-boot) - a Gummiboot is a rubber dinghy; simple, portable, and easy to deploy"},{"name":"gweled","desc":"a GTK+ clone of \"Bejeweled\", punningly named in Welsh (\"gweled\" means \"vision\")"},{"name":"hadoop-*","desc":"(ex-package) surprisingly doesn't stand for high-availability distributed object-oriented programming; it was stolen from the name the programmer's son gave to a toy elephant (an arbitrary animal with convenient undertones of \"lumbering but lovable\")"},{"name":"halibut","desc":"(doc-formatter) \"Historical reasons. It's probably better not to ask.\""},{"name":"handlebars","desc":"a JavaScript tool for handling templates, designed to be a compatible replacement for mustache, which is so-called because it uses lots of mustache-like {{braces}}"},{"name":"haserl","desc":"lightweight CGI wrapper system; a Bavarian word for \"bunny\" (so another semi-arbitrary animal)"},{"name":"heat-*","desc":"(OpenStack orchestration service) as in atmospheric dynamics and cloud creation"},{"name":"heimdal-*","desc":"free implementation of Kerberos 5; named after another mythological watch-keeper (in this case a Norse god)"},{"name":"herbstluftwm","desc":"(tiling window manager) it's not a random stack of letters, it's a beautiful German word! Herbst-Luft-WM, the Fall-Air (or should that be Autumn-Breeze?) Window Manager, is so called because the author liked the sound of the MUA \"wanderlust\" AKA wl"},{"name":"hesiod","desc":"a name service for storing system databases; another classical reference from Project Athena - Hesiod was biographer to the gods"},{"name":"ho22bus","desc":"vocabulary learning software for and by non-native English-speakers; the name is short for \"honorificabilitudinitatibus\", the longest word in Shakespeare, and has nothing to do with any other sort of bus"},{"name":"hotot","desc":"(ex-package) (micro-blogging Twitter/Identica client) named after a breed of dwarf rabbit (which is named after a place in Normandy) (pronounced \"oh-TOE\")"},{"name":"hugs","desc":"(Haskell interpreter) Haskell user's gofer system, Haskell being named after the logician Haskell Curry (<homer>mmm, curry</homer>)"},{"name":"hugin","desc":"(panoramic photo stitcher) named after one of the two ravens of the Norse god Odin (cf. the otherwise unconnected package munin). The name is Old Norse for \"thought\""},{"name":"hunspell","desc":"a spellchecker that was originally specific to Hungarian"},{"name":"hylafax-*","desc":"the HylaFAX telecopying server (renamed from FlexFAX to avoid trademark issues) is named after a genus of tree-frog because it makes deafening croaking noises?"},{"name":"i2c-tools","desc":"I-squared-C, meaning \"Inter-Integrated Circuit\", is a hardware bus protocol, which gets us a little closer to guessing that it means \"tools for reading from hardware health-monitoring sensors\""},{"name":"i3","desc":"designed as the successor to wmii, this is the third generation of improvements to this kind of window manager and stands for Improved Improved Improved, shortened to i3"},{"name":"iagno","desc":"it admits to being similar to Go (not that go) and derived from Reversi; but the key to understanding the name is that it's \"GNOME iago\", because the name of the trademarked version is Othello, and when you metaphorically invert Othello (in the play of the same name) you get Iago"},{"name":"icebox","desc":"(now a virtual package) middleware development framework using ZeroC's Internet Communications Engine (2003)"},{"name":"icecast2","desc":"streaming audio server, a cool (?) free clone of Shoutcast (1998; I'd have thought a \"rogue shoutcast\" would be an \"outcast\")"},{"name":"icedax","desc":"free fork of cdda2wav for cdrkit (see also wodim); supposedly the Incredible Digital Audio Extractor, but note that this fork happened just as iceweasel was being renamed"},{"name":"icedtea-*","desc":"free version of OpenJDK (see Java), which couldn't use that trademarked name (2006 again)"},{"name":"iceweasel","desc":"temporary branding-free microfork of Mozilla firefox; for background see Wikipedia (plus iceape, icedove; all renamed 2004-2006)"},{"name":"icewm","desc":"Win95-alike window manager, named \"on a very hot day\" (in 1997)"},{"name":"icinga","desc":"a fork of NAGIOS which was careful to pick a name that's definitely untrademarked. \"Icinga\" means \"it browses\" in Zulu (where \"C\" represents a tutting sound)"},{"name":"idle","desc":"officially an Integrated DeveLopment Environment for Python (rather than being named after Monty Python's Eric Idle). Predated eric"},{"name":"inotify-tools","desc":"inotify is a Linux filesystem-monitoring interface, but what does the \"I\" stand for? It replaced dnotify, where the \"D\" definitely stood for \"Directory\"; so the answer is probably \"Inode\". But even Dennis Ritchie wasn't sure what the \"I\" in \"Inode\" stood for! The traditional guess was \"Index\", but it's only a guess"},{"name":"insserv","desc":"reading between the lines of its man page's EXIT CODES section, \"install services\", i.e. \"add daemons to the SysV init system\""},{"name":"iptables","desc":"tool for configuring the Linux kernel's handling of IPv4 packets; the package description does manage to mention the word \"firewall\", but never fully explains the package's name. There's no rows-and-columns structure involved; it's just that each firewall rule is an \"IP chain\" (as used by the old ipchains) and the chains are grouped into sets called \"IP tables\" (it's nothing to do with ipting everything iptable, either)"},{"name":"ironic-*","desc":"(OpenStack provisioning server) a nice obvious pun on bare metal"},{"name":"irssi","desc":"phonological pun (not necessarily in English) on ircII, \"Internet Relay Chat client, second edition\""},{"name":"ispell","desc":"(spellchecker) nothing to do with iBooks! It was the first interactive successor to UNIX spell"},{"name":"isso","desc":"(web commenting system) German online abbreviation for \"ich schrei sonst\" (\"otherwise I'll scream\")"},{"name":"istanbul","desc":"(ex-package) (desktop recorder) disappointingly this  was never known as constantinople; it was named after a particular football match (\"Liverpool's fifth European Cup triumph in Istanbul on May 25th 2005\")"},{"name":"iw","desc":"a package (and CLI tool) that might have been called ieee802.11-standard-wireless-network-interface-device-configurator-utility; it replaces iwconfig, which was like ifconfig with a \"W\" for \"wireless\" jammed in seemingly at random (and compare the similarly basic iproute2 command ip)"},{"name":"jami","desc":"(phone AV/chat platform) \"inspired by a Swahili word that means 'community'\" though my dictionary says that's \"jamii\", and \"jami\" means \"jam\""},{"name":"java-*","desc":"the programming language is named after (a variety of) the raw material that mathematicians turn into theorems (this by the way was originally a pun about rather than by Erdős in either German or Hungarian, which use the same word for \"theorem\" and \"leftover coffee grounds\")"},{"name":"javascript-*","desc":"a programming language announced as a web technology just as Java was becoming successful in that field, and widely suspected of being named as a deliberate ploy to ride on its coat-tails, though it had been known as \"Mocha\" very early in its development"},{"name":"jenkins*","desc":"a fork of Oracle's software building/testing infrastructure, Hudson™; both are vaguely butlery names, and Jenkins has the bonus of beginning with J-for-java Jeeves was taken"},{"name":"jerry","desc":"Chess GUI; thematically named by its German developer after the existing \"Fritz\" - both being wartime nicknames for Germans"},{"name":"jetty*","desc":"(Java servlet engine) the FAQ mentions several reasons (but skips \"it's a safe place to launch things\")"},{"name":"jffnms","desc":"(ex-package) not very appropriately a Just For Fun Network Management System"},{"name":"joe","desc":"Joe's Own Editor by Joseph H. Allen (whose first name is often abbreviated Joe)"},{"name":"jovie","desc":"formerly kttsd (KDE Text-To-Speech Daemon) but renamed after the developer's daughter"},{"name":"jpnevulator","desc":"originally created as a Jackpot Navigator emulator (for interfacing with slot machines), it transformed into a serial sniffer that is able to send data on a serial line too. Giving credit to this first use, the name is some sort of strange mash up"},{"name":"jupp","desc":"fork of JOE named after the author's friend Josef, which can be abbreviated Jupp or Sepp depending on the part of Germany you live in - the latter more common in Bavaria"},{"name":"k3b","desc":"(KDE CD/DVD-burner) the \"K\" is obvious, but it's not \"K-times-three B\" (because that's a KKK-burner); it's not \"K[...three letters...]B\" (because that's a kebab); it's \"a K and three Bs\", meaning \"KDE Burn, Baby, Burn\""},{"name":"*kafka","desc":"no, Amazon Kafka isn't named in the expectation that it will someday metamorphose into a single enormous bug; the author says it's \"a system optimized for writing\""},{"name":"kadu","desc":"a KDE-based client for the gadu-gadu Instant Messaging protocol (popular in Poland, where \"gadu-gadu\" is \"chit-chat\")"},{"name":"kamailio-*","desc":"(SIP proxy) was called \"OpenSER\", then dodged a trademark with the Hawaiian word \"kama‘ilio\" = \"talk/converse\""},{"name":"kanla","desc":"(ex-package) (outage-spotter) you might guess from the logo that it means \"eye\", but you probably wouldn't guess the source language: Lojban"},{"name":"karbon","desc":"(KOffice/Calligra vector graphics package) originally known as Karbon14 after the isotope used in radiocarbon-dating (for some reason... Successor of Kontour, formerly unwisely known as KIllustrator)"},{"name":"kde-*","desc":"originally a replacement for the Common Desktop Environment with a Kooler arbitrary initial letter. However, these days for branding reasons the desktop environment is officially called Plasma, and KDE is just the developer community, so presumably it doesn't stand for anything. (Meanwhile, following Plasma's states-of-matter theme, the hardware support framework is provided by libsolid)"},{"name":"kephra","desc":"(text editor) named after \"the scarab god (neter) of ancient Egypt\", since that deity created himself and this is software that the programmers use to produce new versions of itself. But while \"neter\" may be the Ancient Egyptian for \"deity\", \"kephra\" appears to be a typo for \"Khepra\"..."},{"name":"keystone","desc":"(OpenStack authentication service) a crucial building-block, and as a bonus the word sounds as if it means something security-related rather than just a lump of masonry"},{"name":"kgb-client","desc":"KGB is a bot relaying VCS commits to IRC notifications, successor to CIA, which was \"a brainless entity designed to keep an eye on subversion\". Not related to kgb the file-compressor."},{"name":"kismet","desc":"(wireless sniffer) \"The word itself means Fate or Destiny. While I wish I could make up some smart comment about picking it because Kismet will ultimately uncover every active wireless network in the area, really I just needed a name and was clicking through a thesaurus and liked the sound.\""},{"name":"klibc-utils","desc":"tools built with an alternate C library specialized for use at boot-time - the \"K\" is for (the Linux) Kernel"},{"name":"kodi","desc":"the media center formerly known as xbmc, XBox Media Center, or (even earlier) Xbox Media Player. That name became misleading and awkward, so they picked one that (among other considerations) is vaguely connected to the word \"code\""},{"name":"kodos","desc":"(ex-package) regexp debugger named as an arbitrary Simpsons reference (Kodos being one of the UFO aliens)"},{"name":"konqueror","desc":"(KDE file manager and web browser) the name is a play on the names of its competitors at the time: after visits from a Navigator and an Explorer, the next to arrive is the Conqueror"},{"name":"kopano-*","desc":"groupware; formerly known as zarafa (which means \"giraffe\", but was also the name of a famous zoo giraffe). Continuing the same arbitrary ungulate connection, \"Kopano\" is \"united\" in Tswana (as spoken in Botswana), and the name of a baby giraffe at Dallas zoo"},{"name":"kopete","desc":"KDE chat client; copete in Spanish is literally \"tuft of hair\", but Chilean slang for \"a drink with your friends\" (so kopete translates as either kuiff or kuaff)"},{"name":"krb5-*","desc":"squeezed name for \"MIT Kerberos version five\"; Kerberos was the watchdog of the Greek underworld (also known in Latinized form as Cerberus), so it's a natural label for the network authentication protocol originally designed for Project Athena"},{"name":"krita","desc":"KOffice/Calligra graphics package; in Swedish, \"krita\" means \"chalk/crayon\" and \"K-rita\" is \"K-draw\"; but if that's not enough justification, \"krita\" is also Sanskrit for \"perfect\" (Formerly known as Krayon. Compare also the obsolete KOffice component names \"Kivio\" = approximately \"K-Visio\" and \"Kugar\" = just an arbitrary animal misspelled with a \"K\"?)"},{"name":"krusader","desc":"a two-panel file manager in the tradition of Midnight Commander, with a \"K\" for KDE. All the names like kommander, kontroller, and kaptain had already been claimed, so this app has ended up with one that won't make it popular in the Middle East (though there's no sign of a korporal, kolonel, kommodore, kommissar, konsul, or kaiser)"},{"name":"kupfer","desc":"a launcher described as \"in the style of\" Mac OS X's Quicksilver. \"Kupfer\" is German for \"copper\", so apparently it's just a thematic chemical element and the K doesn't indicate a particular desktop allegiance"},{"name":"latexila","desc":"a LaTeX editor; pun with LaTeX and tequila, « la tequila » meaning “the tequila” in French"},{"name":"lazarus","desc":"an IDE for Pascal; a \"back from the dead\" fork of the Megido project (which was an attempt to clone Delphi, which was in turn \"where you go to talk to an Oracle\")"},{"name":"ldap-*","desc":"the lightweight directory access protocol provided a \"telephone directory\" system that was lightweight in terms of bandwidth usage compared to the X.500 DAP"},{"name":"leela-zero","desc":"(go-playing engine) \"Leela\" is a Futurama \"one eye\" reference; the author already had an engine with that name before this reimplementation of AlphaGo-Zero"},{"name":"leiningen","desc":"Clojure project tool; a reference to the short story \"Leiningen Versus the Ants\""},{"name":"lektor","desc":"(website CMS) German for \"reader/literary editor\""},{"name":"lemonldap-ng-uwsgi-app","desc":"a uWSGI server (Web Server Gateway Interface, but is it u-for-Unbit or mu-for-micro?) for the Next Generation version of this online LDAP server... a fork so old that all trace of the original has faded from the web, probably taking with it the reason for the citrusy name"},{"name":"lesstif*","desc":"(ex-package) first there was the Open Software Foundation's proprietary User Environment Component, which was named Motif in an in-house name-the-GUI-widget-toolkit competition and went on to become a UNIX industry standard. That had an LGPLed fork named LessTif (\"less\" being the opposite of \"mo'\") and a just-good-enough-for-nonfree fork called OpenMotif; but now Motif itself has gone GPL and lesstif is no more"},{"name":"libbobcat*","desc":"(C++ toolkit) Frank Brokken's own base classes and templates"},{"name":"libbonobo*","desc":"deprecated CORBA precursor to dbus. Developed by Ximian and named like most of their products with an arbitrary word out of primatology"},{"name":"libc6","desc":"obviously, the main system libraries for the C programming language, version six; the source package is called eglibc, meaning the fork of the standard GNU libc originally developed for embedded systems. But why \"C\"? First (in sixties Cambridge) there was CPL, the Combined (i.e. collaboratively developed) Programming Language - though some accounts say the C was originally for Christopher (Strachey). Then there was BCPL (Bootstrap or later Basic CPL); next that got stripped down to \"B\", then reimplemented as just \"C\". Self-proclaimed successors to C include \"C++\" and \"D\"."},{"name":"libcaca*","desc":"see caca-utils"},{"name":"libcairo*","desc":"see cairo*"},{"name":"libexpat*","desc":"see expat"},{"name":"libfribidi*","desc":"see *fribidi*"},{"name":"libglib*","desc":"see *glib*"},{"name":"libharfbuzz*","desc":"(Unicode-capable text shaping library) a calque of \"OpenType\" in the original developer's native Persian (plus an untranslatable pun)"},{"name":"libklibc*","desc":"see klibc-utils"},{"name":"libmotif*","desc":"see lesstif*"},{"name":"libnepomuk*","desc":"a \"networked environment for personal, ontology-based management of unified knowledge\" (as part of a \"semantic desktop\"); the word also happens to be a town in the Czech republic"},{"name":"libpango*","desc":"see *pango*"},{"name":"libsoup","desc":"was originally a library for SOAP, which sounds like \"soup\" when pronounced with certain accents (ref)"},{"name":"libwayland*","desc":"see wayland"},{"name":"libxerces*","desc":"(Apache C++ XML-handling toolkit) named after King Xerces, AKA Ahasuerus, AKA Khshayarsha I, AKA Xerxes the Great of Persia (son-in-law of Cyrus), perhaps indirectly via the extinct Californian butterfly the Xerces Blue. is there any reason behind this beyond \"begins with X\"?"},{"name":"lsb-base","desc":"expands to \"Linux Standard Base base\", which is a little confusing when it's a required package even on Debian GNU/kFreeBSD"},{"name":"lsh-server","desc":"an SSH2 daemon, but the significance of the \"L\" is long lost (Lysator? Liberty? Left?)"},{"name":"lua*","desc":"Brazilian programming language inspired by the Simple Object Language (in Portuguese, \"sol\" is \"sun\" and \"lua\" is \"moon\"). \"Linguagem para Usuarios de Aplicação\" (Language for Application Users) is just a jokey backronym; writing it as LUA is now considered a Lua Uppercase Accident."},{"name":"lynx","desc":"a punning animal name. Pre-Stretch the package was confusingly called lynx-cur, a relic of the days when there were separate packages based on the current and stable versions"},{"name":"lyx","desc":"this LaTeX document processor was originally named LyriX (which apparently is just something that sounded good and vaguely resembled LaTeX) but that turned out to be taken, so it changed to something that let it keep the .lyx file extension"},{"name":"lzop","desc":"(compression tool) the name may look like a compressed version of LZOzip, but officially it's the Lempel–Ziv–Oberhumer Packer"},{"name":"m4","desc":"(macro processor) GNU M4 is indeed a successor to m3, but that was seemingly so named not because there had ever been an m2 but because it was a macro-processor for the AP-3 minicomputer. Some short command-names (such as cp, df, or ls) may function to save ordinary CLI users the effort of typing anything longer, but m4 rarely needs to be invoked manually (it's just called by automated build systems). The two-letter name is a mark of its age and importance"},{"name":"mach","desc":"(ex-package) tool to make a chroot for an RPM-based distro (not to be confused with GNU MACH or with the ATI GPU). The word \"mach\" also happens to be German for \"make\", and the surname of a German physicist who gave his name to various cool things"},{"name":"magnum-*","desc":"(OpenStack containers-as-a-service) because a magnum can be a container for a lot of champagne, and/or bullets or maybe  \"Magnum A.P.I.\" is an eighties TV reference"},{"name":"mahimahi","desc":"(network emulation toolkit) mahi-mahi is the Hawaiian name for the creature better known elsewhere as the dolphinfish or dorado - apparently just a random animal with no intended implication that it might get tangled in your net (Maybe it was named in a restaurant?)"},{"name":"mandos","desc":"(encrypted-rootfs server) nothing to do with man or DOS; a rather obscure Tolkien reference"},{"name":"manila-*","desc":"(OpenStack filesystem as a service) punning on \"manila folder\", the kind of file container originally made from manila hemp"},{"name":"mantis","desc":"(ex-package) a bugtracker named after a bug-catching insect (though since it's web-based, why not a spider?)"},{"name":"marco","desc":"(metacity fork for MATE, thematically named in Spanish) \"frame\" nothing to do with Mr Polo"},{"name":"mariadb-*","desc":"non-Oracle-owned fork of MySQL by the original developers, including Monty Widenius, whose younger daughter is named Maria"},{"name":"mate-*","desc":"(fork of GNOME 2, so often misleadingly written MATE) nothing to do with sex or death: it's just named after the South American beverage, presumably to fit Linux Mint's \"herbs and spices\" theme - cf. cinnamon"},{"name":"mathopd","desc":"(ex-package) (web server) from the developer's IRC nick (according to the old FAQ, now forgotten even by archive.org)"},{"name":"maven","desc":"(Java build management tool) a Yiddish word for \"expert\" or \"wisdom-gatherer\" adopted into US English; the idea is that maven is a central place for build-information"},{"name":"mawk","desc":"Mike Brennan's implementation of the pattern scanning and text processing language AWK, which is named after its authors - Alfred Aho, Peter Weinberger, and Brian Kernighan"},{"name":"mc","desc":"this file-manager is a clone of \"NC\", Norton Commander (yes, it's that old); its full name is \"GNU Midnight Commander\". Okay, that explains the \"C\". But what's so Midnightish about it - why wasn't it called, say, \"console commander\"? Either there's an obscure cultural reference here or maybe version 0.0 was called \"Nocturnal Commander\""},{"name":"melange","desc":"(ex-package) (former OpenStack IP-address-manager) first introduced with a \"Dune\" reference (\"the IPs must flow\")"},{"name":"menhir","desc":"(OCaml parsergenerator) Breton for standing stone; cf morbig the Old Celtic connection would make more sense if the language was called Ogam-L..."},{"name":"mercurial","desc":"created during the bitkeeper troubles with the Linux kernel, and named in honor of BitMover CEO Larry McVoy (since it can mean \"fickle\"). Also because it conveniently abbreviates to \"hg\" (chemical symbol of mercury), and because it fits the existing namespace of selenic.com nothing to do with Merkle hash trees"},{"name":"mesa-utils","desc":"mesa is an implementation of the OpenGL 3D graphics system; the developer recalls \"The name Mesa just popped into my head one day. SGI had asked me not to use the terms ''Open'' or ''GL'' in the project name and I didn't want to make up a new acronym\""},{"name":"meson","desc":"(Python build system) not a typo for \"mason\"; they were thinking of calling it \"gluon\", but this was the closest name still unclaimed"},{"name":"metacity","desc":"an otherwise deliberately uncool window-manager named after an arbitrary cool (made-up) word - \"Metacity is not a meta-City as in an urban center, but rather Meta-ness as in the state of being meta, i.e. metacity : meta as opacity : opaque. Also it may have something to do with the Meta key on UNIX keyboards.\" Though surely metacity would be the state of being metacious?"},{"name":"mg","desc":"(text editor) originally \"MicroGnuEmacs\" (there was already a \"MicroEmacs\"), but since it doesn't actually have anything to do with GNU the developer was asked to rename it, and chose somewhat eccentrically to make it a MilliGnu (well, I suppose PicoEditor was taken)"},{"name":"mhonarc","desc":"Mail-to-HTML archiving tool, which explains most but not quite enough of it"},{"name":"mimedefang","desc":"a general-purpose email filter named after its original specialty: making safe (\"de-fanging\") message attachments (MIME = Multipurpose Internet Mail Extensions)"},{"name":"mistral-*","desc":"(OpenStack business workflow service) named after a seasonal wind - i.e. a predictably scheduled \"flow\" of air"},{"name":"mksh","desc":"the MirBSD Korn Shell (after ksh88/ksh93 which are named for their author David G. Korn); from one of the more recent BSD derivatives"},{"name":"mlocate","desc":"a locate implementation where the \"M\" stands for \"merging\""},{"name":"*moinmoin*","desc":"the name of the MoinMoin wiki-engine is taken from a Dutch/Low Saxon greeting roughly equivalent to \"aloha\", presumably chosen because (like lots of wiki-engine names) it's informal and repetitive. It has nothing to do with the Nigerian steamed bean pudding of the same name"},{"name":"molly-guard","desc":"named after the plexiglass covers used to protect the Big Red Switch on University of Illinois servers from marauding toddlers"},{"name":"mongodb","desc":"an unfortunate name in various Germanic languages, but it's intended to imply that it's a database system that scales to humongous sizes"},{"name":"monkeysphere","desc":"this community-driven cryptographic certification framework is named in reference to Dunbar's Number, an estimate of the maximum number of peers a primate can effectively keep track of while negotiating social relationships"},{"name":"mono-*","desc":".NET-compatible programming platform; it was first developed by Ximian, and \"mono\" is Spanish for \"monkey\", so it's yet another semi-arbitrary primate name"},{"name":"morbig","desc":"(POSIX shell parser) Breton (cf. menhir) for \"oystercatcher\", a picky eater"},{"name":"mozilla-*","desc":"originally Netscape's in-house codename/mascot for what they hoped would be a \"Mosaic killer\" (with perhaps a hint of self-deprecation); nowadays the \"moz\" part is often used as an abbreviation for Mozilla(-based browser)"},{"name":"mozo","desc":"(alacarte fork for MATE, thematically named in Spanish) \"servant\" or \"waiter\" (a menu-handler) nothing to do with mozilla"},{"name":"mrd6","desc":"multicast routing daemon for IPv6"},{"name":"muffin","desc":"a fork of Mutter for the cinnamon desktop - a name close in form to the former and associated in meaning with the latter"},{"name":"munin","desc":"(network monitor) named after one of the two ravens of the Norse god Odin (cf. the otherwise unconnected package hugin). The name is Old Norse for \"mind\" or \"memory\""},{"name":"murano-*","desc":"(OpenStack application catalog) named (arbitrarily?) after a set of islands in Venice famous for glassmaking"},{"name":"mutt","desc":"a self-deprecatory animal-name close to \"MUA\" (and maybe \"TTY\"?). It was forked as neomutt when development slowed down, but has now learned some new tricks"},{"name":"mutter-*","desc":"GNOME window manager; a derivative of Metacity using the Clutter graphics library for compositing (and libclutter is so called because... it's a Canvas Library that lets you fill the screen with all sorts of complicated junk?)"},{"name":"mysql-*","desc":"a Structured Query Language server named after the original developer's daughter \"My\" (cf. also mariadb)"},{"name":"nagios*","desc":"a network monitor, formerly known as NetSaint, but to avoid trademark issues uninformatively renamed as \"Nagios Ain't Gonna Insist On Sainthood\". Indeed it's gone rather out of its way not to infringe: \"HAGIOS\" would have worked equally well for that recursive acronym and would have been the New Testament Greek for \"saint\"..."},{"name":"nano","desc":"allegedly, nano's another editor; a smaller and for a long time freer clone of pico, the pine composer (that is, the text-editor for the pine MUA - see alpine)"},{"name":"nautilus","desc":"a file-system-navigating shell, named after a non-arbitrary animal: the shelled cephalopod whose name means \"sailor\""},{"name":"ncompress","desc":"new-in-the-nineties version of the standard UNIX file compressing utility, using the (then) patent-encumbered LZW algorithm (unlike gzip's compatibility version); see zlib1g"},{"name":"ncurses-*","desc":"a new-in-the-nineties free fork of the curses terminal (and cursor) control library used for Text User Interfaces (aptly named for the activity you’re sure to do when programming with libcurses)"},{"name":"nedit","desc":"originally the Nirvana Text Editor in 1991, so maybe not a direct reference to the religious sort of nirvana"},{"name":"nemiver","desc":"a GNOME debugger; verlan (French backslang) for \"vermin\""},{"name":"nemo","desc":"file manager for the cinnamon desktop, but with no spicy connection in the name (and not a Pixar reference); this is a fork (\"steering in a new direction\") of Nautilus, and Nemo was the Latin and/or Greek nom de guerre of the commander (cf. mc) of the fictional submarine of that name"},{"name":"nethack-*","desc":"not a net-hacking tool or even a game played over the net. It was a game (of hacking a trail through a virtual dungeon) that was distributed and cooperatively developed over USENET"},{"name":"netpbm","desc":"commandline image manipulation tools using portable bitmap and related formats; like the above (or indeed NetBSD) it uses \"net\" to mean roughly \"maintained by an open, widely distributed group of contributors\""},{"name":"neutron-*","desc":"(OpenStack networking service) a similarly science-y albeit slightly less cloudy name to replace quantum after a trademark clash with the hardware manufacturers, not any of the several \"Quantum software\" companies"},{"name":"newsboat","desc":"(RSS feedreader) a fork of newsbeuter, which was a German pun on \"hunter-gatherer\""},{"name":"nginx","desc":"(web server, pronounced as \"engine-X\" and not as a rhyme for \"minx\") because it powers your web site and brand-names sound cooler if they end in X. The package nginx-naxsi-ui is especially cryptic: it's the nginx anti-XSS-SQL-injection module's user interface (Cross-Site Scripting is abbreviated XSS because calling it CSS would be too confusing - though since they needn't involve any \"cross-site\" or \"scripting\", it's a pity they didn't just switch to calling them \"client-mediated exploits\" or something...)"},{"name":"ninka","desc":"(software license manager) Japanese for \"permission, license\""},{"name":"nmh","desc":"new-in-the-nineties version of the MH message handler (a CLI mailreader toolkit dating back to the seventies)"},{"name":"nnn","desc":"\"Nnn is Not Noice\". Remember the file manager noice? Me neither"},{"name":"nodejs","desc":"(JavaScript platform) originally web.js, but renamed to node.js to imply it could function as any other kind of network component. Not to be confused with the amateur packet radio program ax25-node, formerly known as node"},{"name":"notmuch","desc":"(mail indexer) among other things, it's the answer to sup"},{"name":"nova-*","desc":"(OpenStack Compute service) after NASA's similar \"Nebula\" (which was named from the Latin for \"cloud\")"},{"name":"ntfs-3g","desc":"\"NT file system support, third generation\" - a fork, since re-merged, of ntfsprogs; but when was \"-2G\"? (\"Windows NT\" has a confused history, but is officially meaningless)"},{"name":"nvi","desc":"new-in-the-nineties version of vi, q.v."},{"name":"nwall","desc":"new-in-the-nineties version of wall, the utility for writing messages to all logged-in users"},{"name":"nwrite","desc":"new-in-the-nineties version of write (A.K.A. bsd-write)"},{"name":"nyquist","desc":"music-score language named after phone engineer Harry Nyquist, who discovered noise"},{"name":"nyx","desc":"(TOR monitor) goddess of night, a short and memorable classical reference"},{"name":"obex-data-server","desc":"the object exchange protocol is used for sending stuff over IrDA/Bluetooth, and has nothing to do with the \"obex\" which is part of the brainstem"},{"name":"obnam","desc":"(ex-package) (backup system) short for \"obligatory name\", in the sense that it had to have one, and this arbitrary string will do"},{"name":"ocaml","desc":"objective caml (originally the punning \"categorical abstract machine language\"; and let's not forget that \"objective\" in this sense is also a play on words)"},{"name":"ocsigenserver","desc":"ocaml web server; a homophone of \"oxygen\" (in French; it could have been \"ocxygène\", but this version is 7-bit clean). Its scripting module eliom is a similar play on \"hélium\""},{"name":"octave*","desc":"(MATLAB-like number-crunching language) GNU Octave isn't named after the musical scale - it's in honor of a chemical engineering professor famed for his calculating skills, Octave Levenspiel"},{"name":"oidentd","desc":"Ojnk Software Design identification daemon"},{"name":"openjade","desc":"a contribution-friendly fork of jade, which never officially stood for anything, though early reports were that it was \"James (Clark)'s awesome DSSSL engine\" (DSSSL being \"Document Style Semantics and Specification Language\" - in other words an SGML/XML document formatting standard)"},{"name":"openstack-*","desc":"(cloud computing architecture) named in terms of the stack metaphor originally applied to \"layered\" network protocols; but there's a hint of a \"cloud layers\" pun here (after all, its proprietary rivals include \"CloudStack\")"},{"name":"openswan","desc":"(ex-package) as in StrongSwan and FreeS/WAN (which is punctuated a bit more transparently), \"swan\" indicates \"Secure Wide Area Network\""},{"name":"orage","desc":"originally named xfcalendar, but switched to the French for \"thunderstorm\"; this may be a pun on \"agenda organizer\" in one language or another, or it may be because Mozilla Thunderbird's calendaring extension is called \"lightning\""},{"name":"oregano","desc":"GNOME circuit simulator, named thematically after the Simulation Program with Integrated Circuit Emphasis; it can't hurt that this one has a \"G\" in it"},{"name":"orthanc-*","desc":"medical database server; a Tolkienian wizard's home"},{"name":"owl","desc":"(ex-package) client for Zephyr, which was the original Instant Messaging protocol for Project Athena - Zephyr being the Greek god of the west wind and the owl being the (wind-borne) mascot of Athena (the \"staying up all night\" part might be relevant too). This package has approximately zero users, but there's also a fork called barnowl which has at least a few"},{"name":"pan","desc":"is now too embarrassed to admit that it was claiming to be a pimp-ass newsreader (which for obscure reasons is a boast rather than an insult)"},{"name":"*pango*","desc":"a cross-language hybrid: \"pan\" (Greek for \"every\") plus \"go\" (not quite Japanese for \"language\")"},{"name":"parole","desc":"in French this doesn't mean \"getting out of prison by giving your word of honor that you'll behave\", it's just \"(spoken) word\", and thus a reasonable name for a simple media player"},{"name":"parrot","desc":"(now appropriately an ex-package) (common virtual machine for dynamic languages) named after a historic April Fool's hoax that came true"},{"name":"passepartout","desc":"(ex-package) desktop publishing app. Originally \"Framer\" (compare FrameMaker), then renamed to something more interesting: a \"passepartout\" is a kind of cardboard frame that you put around watercolor paintings. (In the original French it also means \"skeleton key\", but that doesn't necessarily mean it installs a back door on your computer)"},{"name":"patroni","desc":"a fork of \"Governor\" thematically named after various related pieces of software with names that generally mean \"boss\" (except isn't the word they were aiming for spelled \"patrone\"?)"},{"name":"pcmanfm","desc":"(file manager) because the main developer's nickname is \"PCMan\""},{"name":"pekwm","desc":"(window manager) the original developer had the pseudonym \"pekdon\", which means \"pointing device\" in Swedish (more literally \"pick tool\"), so presumably it's that and not the brand of spamlike canned meat"},{"name":"perl","desc":"the expansions \"Practical Extraction and Report Language\" and \"Pathologically Eclectic Rubbish Lister\" are backronyms; it started (very briefly) as Pearl, then got shortened to something more distinctive"},{"name":"pfstools","desc":"utilities for handling files in what they decided at the last minute to call portable floatmap streams format"},{"name":"phonon","desc":"(KDE multimedia framework) in physics a phonon is a sort of unit of sound energy, and presumably in this case it's traveling through Plasma"},{"name":"php5","desc":"originally \"personal home page\"; now redefined as the recursive \"PHP hypertext preprocessor\""},{"name":"php5-suhosin","desc":"(ex-package) (security hardening patch) Suhosin is Korean for \"guardian angel\" (or maybe \"divine protection\"; but the package now looks distinctly godforsaken)"},{"name":"pidgin","desc":"trademark-dodging rename of gaim, the GTK+ AOL Instant Messenger; now named as a common medium of communication. Uses the libpurple protocol plugin library"},{"name":"pike*","desc":"programming language, derived from µLPC (micro-Lars-Pensjö-C) but given \"a more pronouncable and commercially viable name\". (sic) The logo implies they were thinking of the fish rather than the polearm"},{"name":"pinfo","desc":"Przemek's Info Viewer"},{"name":"ping","desc":"named after the sonar pulse; \"packet Internet groper\" is a backronym"},{"name":"pinto","desc":"(Perl module repository tool) named for the programmer's son"},{"name":"pitivi","desc":"(video editor) the name comes from \"Epitech\" (the college where its developer was studying) plus (a franglais spelling of) \"T.V.\""},{"name":"pluma","desc":"(gedit fork for MATE, thematically named in Spanish) \"feather/quill/pen\""},{"name":"pluxml","desc":"(XML-based blog) French portmanteau of plume (feather, as in light-as-a) and XML"},{"name":"plymouth","desc":"(graphical boot splash) probably named after one of the Plymouths that were stepping-stones in the anglophone colonization of the new world"},{"name":"po-debconf","desc":"there has never been a Debian Conference on the river Po. This is a tool for handling .po files (that is, gettext Portable Object message-catalogs) for debconf templates"},{"name":"pocketsphinx","desc":"a version designed for embedded use of the SPHINX speech recognition system, initially developed at Carnegie Mellon University in the eighties and named in the same tradition as the seventies CMU systems \"DRAGON\" and \"HARPY\". Not related to the Python documentation system python-sphinx; neither of these are claiming to be like the sphinx of classical myth whose diet was people who had failed to solve its riddles."},{"name":"polari","desc":"(GNOME IRC client) from the name of the cant traditionally used in various underground subcultures in the UK"},{"name":"poppler-*","desc":"(PDF renderer fork of XPDF) a Futurama reference, completely arbitrary except perhaps for the fact it begins with \"P\""},{"name":"postfix","desc":"(MTA) apparently an arbitrary word with \"post\" in it"},{"name":"postgresql-*","desc":"a Structured Query Language server which is the successor to the Ingres project, which started as an INteractive Graphic[s] [and] REtrieval System (sources differ when it comes to the bracketed elements) Mind you, if \"Ingres\" was intended as a reference to the French painter, that would imply it's meant to be pronounced [ɛ̃ɡʁ], roughly ENG-grr"},{"name":"potrace","desc":"nothing to do with .po files or pot-racing (that's dopewars); it \"outlines\" bitmap images as PostScript vector images using a polygon-based tracer"},{"name":"praat","desc":"(speech analysis app) Dutch for \"talk\""},{"name":"pragha","desc":"lightweight music player named after a friend's band"},{"name":"prayer","desc":"(IMAP-based webmail server) derived from the Web IMAP/NNTP Gateway (as in \"on a wing and a prayer\")"},{"name":"prey","desc":"a mechanism for tracking stolen computers; but is it claiming that it preys on things or is it an antipredatory countermeasure? at least they've changed the confusing logo: it's now an actual bird of prey, not a scavenger"},{"name":"primus","desc":"(NVidia Optimus support) see bumblebee"},{"name":"procps","desc":"utilities that use data from procfs, including the process status tool ps, which originally didn't"},{"name":"prometheus","desc":"monitoring system for people who aren't scared of divine vengeance, or just don't overthink their classical references (At least it didn't get called Procrustes)"},{"name":"propellor","desc":"(CMS using haskell and git) \"The name is because propellor ensures that a system is configured with the desired properties, and also because it kind of pulls system configuration along after it. And you may not want to stand too close.\" (Though this doesn't explain the unorthodox spelling of \"propeller\"!)"},{"name":"psi","desc":"an Instant Messaging client with a name taken from parapsychology, which had an appropriately specious official etymology (was the Telepathy/Empathy messaging framework named independently?)"},{"name":"pstack","desc":"displays a process's stack (the data structure storing subroutine return addresses)"},{"name":"pulseaudio","desc":"(sound server) formerly Polypaudio, but renamed to something a bit cooler and more music-related with the same initials"},{"name":"pump","desc":"(BOOTP/DHCP client) because \"pumps\", like boots, are footwear - at least in some parts of England; elsewhere they may be called \"plimsolls\" or \"sneakers\""},{"name":"putty","desc":"(cross-platform SSH client) officially meaningless"},{"name":"python","desc":"is of course a Monty Python reference"},{"name":"python-django","desc":"see *django*"},{"name":"python-dulwich","desc":"a somewhat obscure Monty Python reference: \"Dulwich takes its name from the area in London where the friendly Mr. and Mrs. Git once attended a cocktail party\""},{"name":"python-kafka","desc":"see *kafka"},{"name":"python-moinmoin","desc":"see *moinmoin*"},{"name":"python-six","desc":"(Python 2/Python 3 compatibility library) because 6 is 2*3 (and 2+3 was taken)"},{"name":"python-theano","desc":"(mathematical compiler) named after Theano of Croton, AKA Mrs Pythagoras"},{"name":"python-twisted","desc":"see *twisted*"},{"name":"python-urwid","desc":"(console UI tools) the FAQ suggests an interpretation (\"ur\" = German for \"primal\" + widgets) but also implies it's a retrofit"},{"name":"qemu","desc":"written QEMU (as if it was a four-word initialism), but it's just a \"quick emulator\""},{"name":"quadrapassel","desc":"formerly gnometris (i.e. GNOME Tetris), but trademark-dodgingly renamed as some sort of thesaurus-mangled version of \"four-block\""},{"name":"quagga","desc":"the earlier routing daemon zebra may have been an Arbitrary Ungulate; when that stopped being developed, its successor was named after a less stripey southern relative, though it's a bit backwards in that zoologically it's the quagga that's extinct"},{"name":"quantum-*","desc":"(OpenStack networking service; see also neutron) basically just because it sounds science-y"},{"name":"quassel","desc":"(IRC client) a German word for \"blather\" or \"jabber\""},{"name":"quodlibet","desc":"(music organizer) In Latin \"quod libet\" is \"whatever you want\"; in English a quodlibet is a particular kind of musical improvization; and in Subversion as it happens the repository started with a \"ql\" directory (originally \"query language\"). See also exfalso"},{"name":"r10k","desc":"(Ruby Puppet deployer) in the style of Randall Munroe's generically-named IRCbot \"Robot 9000\", but rounded up to 10,000"},{"name":"r-base","desc":"GNU R is an implementation of S (for Stats) by two people named Ross and Robert"},{"name":"radon","desc":"(code metrics) probably a reference to the radioactive element formerly used in X-ray machines, and not to the mathematical Radon Transform named after Johann Radon"},{"name":"rakudo","desc":"(Perl6 implementation) Japanese for Paradise, punning on \"rakuda-dō\", \"the way of the camel\""},{"name":"ranger","desc":"the name of this vim-like terminal file manager was influenced by other similar file managers like midnight commander and konqueror.  It's a reference to Chuck Norris, the Texas Ranger. The file manager that roundhouse-kicks the others into oblivion!"},{"name":"rarian-compat","desc":"ex-package; \"formerly Spoon\" - who knows? the documentation metadata framework is called rarian because it depends on librarian0..."},{"name":"rat","desc":"(ex-package) VOIP \"robust audio tool\" produced by the Multimedia Integrated Conferencing for Europe project"},{"name":"rawtherapee","desc":"that's raw as in \"raw digital camera image files\" plus a mangled acronym from the experimental raw photo editor"},{"name":"rear","desc":"disaster recovery tool, short for relax-and-recover"},{"name":"recoll","desc":"short for \"recollect\" (i.e. remember where you put things)"},{"name":"remmina","desc":"GNOME remote desktop client. Unclear, but one backronym that has been offered is \"remote mini assistant\""},{"name":"remotetea","desc":"an esoteric Java ONC/RPC library. Explaining the \"remote\" part is easy; the reference to tea is trickier (but it's not talking about this kind)"},{"name":"rheolef","desc":"French, so the \"EF\" stands for \"Éléments Finis\" (as in Finite Element Analysis); the \"L\" may be for \"Logiciel\" (software) or just part of the word \"rhéologie\" (fluid mechanics)"},{"name":"ries","desc":"RILYBOT Inverse Equation Solver"},{"name":"ristretto","desc":"(image viewer) Italian for a small, concentrated (literally \"restricted\") shot of espresso coffee. This succeeds in combining the ideas of \"powerful\" and \"lightweight\", even if it does misleadingly suggest it's in Java"},{"name":"rofi","desc":"describes itself as a \"window switcher\", so presumably it's because \"rofi\" is \"(a) switch\" in Icelandic"},{"name":"ronn","desc":"(man page builder) the current version is technically Ronn-NG, and takes it for granted you know that originally ronn was the opposite of roff"},{"name":"root-tail","desc":"it doesn't follow the superuser about; it doesn't adhere to the back side of the base mountpoint; it doesn't show the end of an inverse-power frequency distribution; it has nothing to do with rootkits or lemmatization or gardening; it just runs tail and sends its output to the desktop background (the \"X root window\")"},{"name":"rox-filer","desc":"(alternative GUI filesystem browser) part of the \"ROX\" project, which was inspired by the desktop environment on old Acorn computers and stands for \"RISC OS on X11\""},{"name":"ruby","desc":"(programming language) nothing to do with perl, or ruby markup; apparently it was a friend's birthstone (though that sort of explanation would probably work equally well as a justification for calling it Daffodil, Pig, or Cancer)"},{"name":"rust","desc":"(programming language) named after a fungus that is robust, distributed, and parallel, and its creator is a biology nerd."},{"name":"rxvt-*","desc":"Rob Nation's fork of the X11 Virtual Terminal; originally \"Robert's\" xvt, later \"our\" xvt"},{"name":"sac","desc":"for system accounting"},{"name":"sahara-*","desc":"(OpenStack data processing as a service) formerly savannah, renamed to avoid the usual trademark issues (to a word that may look similar but really has pretty much the opposite connotations)"},{"name":"salsa","desc":"[not a package] named in a Mexican restaurant"},{"name":"samba","desc":"the initials of the Server Message Block protocol, plus arbitrary vowels to build a word"},{"name":"sanduhr","desc":"(ex-package) German for \"sand-clock\""},{"name":"sapphire","desc":"a late-nineties window manager named after a mid-eighties one, the screen allocation package providing helpful icons and rectangular environments"},{"name":"sauerbraten","desc":"(non-free FPS game engine) from a traditional German style of pot-roast for some reason... it's probably not relevant that the original recipe used pickled horsemeat"},{"name":"sawfish","desc":"(Lisp window manager) originally sawmill, but changed to avoid a trademark - see (end of) FAQ"},{"name":"scala","desc":"(programming language) officially either a scalable language or an Italian stairway (rather than a classical scale - see also octave)"},{"name":"schleuder","desc":"(GPG-enabled mailing list) German for \"catapult\", which is after all a way of sending things"},{"name":"schroot","desc":"a replacement for dchroot, which was a \"Debian change root\" tool (letting you run processes limited to a given directory as if it was the file system root). Originally developed as sbuild-chroot-helper, where the \"S\" in sbuild stands for source, but the interpretation where it's for \"switch\" (compare su = \"switch user\") is also accepted"},{"name":"scilab","desc":"scientific laboratory - a numerical computation toolkit for processing datasets, compatible with MATLAB (\"matrix laboratory\")"},{"name":"scrobbler","desc":"frontend for services like audioscrobbler, a dot-com that existed only just long enough at the turn of the millennium to establish \"scrobbling\" as a generic word for what it did because these days spying on people's freetime activities counts as a valuable service, even when all the data is held in a wet paper sieve"},{"name":"sddm","desc":"(KDE5 display manager) the simple desktop display manager, originally developed for OpenBSD's Simple Desktop Environment"},{"name":"seafile-*","desc":"the name was originally picked for a peer-to-peer network before it became a cloud service"},{"name":"semanticscuttle","desc":"(ex-package) (PHP bookmark-sharing tool) \"semantic\" in the \"semantic web\" sense (i.e. it involves tagging), \"scuttle\" presumably as a reference to \"scuttlebutt\" or gossip (or then again maybe it's just a case of scuttled semantics; the package now seems to have been holed below the waterline)"},{"name":"senlin","desc":"(OpenStack clustering service) from \"sēnlín\", Mandarin Chinese for \"forest\""},{"name":"slony1-2-bin","desc":"PostgreSQL database-replication server; \"slony\" (\"слоны\") is the Russian for elephants, as in the PostgreSQL logo. The numbering is because this package is version 2.x of \"Slony-I\", not the stalled \"Slony-II\" branch"},{"name":"slrn","desc":"slang-based alternative to the traditional USENET client rn (\"read news\")"},{"name":"slurm","desc":"(network monitor) a Futurama reference with no obvious justification; unconnected to (and older than) the WorkLoad Manager also known as SLURM (and packaged as slurm-wlm), which has the excuse of being a simple Linux utility for resource management"},{"name":"smuxi","desc":"smart multiplexed IRC client"},{"name":"s-nail","desc":"Steffen (Daode) Nurpmeso's revived version of nail (the \"new\" mail)"},{"name":"snort","desc":"software for heavy-duty sniffing (probably)"},{"name":"sox","desc":"long ago short for soundexchange"},{"name":"splint","desc":"the word \"lint\" started out as a word for a form of cloth, before becoming US slang for unwanted fluff, and then a verb meaning \"remove fluff\". In the seventies this verb was turned back into a noun as the name of a utility for \"nitpicking\" C code. That original utility is long gone, but its name has become a general developerese term for \"code debugger\", leading to puns like this: splint claims to be \"First Aid for programmers\" (justifying it as standing for \"secure programming lint\" or \"specifications lint\")"},{"name":"squid*","desc":"(caching web proxy); an arbitrary animal"},{"name":"strigi-daemon","desc":"(ex-package) (file system indexer) a slightly garbled version of the Latin for \"owl\" (because owls are well known for... searching through trees and storing what they find? Isn't that squirrels? Oh well, close enough)"},{"name":"subtle","desc":"subforge.org tiled windowmanager"},{"name":"subversion","desc":"a version control system that set out to overthrow the established social order (with cvs dominant)"},{"name":"sudo","desc":"su-do (\"perform as superuser\"), with a pun on \"pseudo\" (after all, you're not really logged in as root)"},{"name":"sugar-*","desc":"(ex-package) (non-desktop-based UI for children) named as something that helps the medicine go down"},{"name":"sup-mail","desc":"(Ruby MUA) named from the casual greeting \"(what')s up?\" - not to be confused with the Debian package sup, which is an implementation of the CMU Software Upgrade Protocol system"},{"name":"suricata","desc":"(network monitor/IDS) the genus Suricata are the meerkats, a relatively non-arbitrary animal"},{"name":"swath","desc":"smart word analysis for Thai"},{"name":"sweep","desc":"presumably a sound wave editor something something"},{"name":"swift","desc":"(OpenStack storage service) a bird that more or less lives in the clouds"},{"name":"swig","desc":"(C/C++ integration tool for scripting languages) simplified wrapper and interface generator"},{"name":"sylpheed","desc":"(GTK MUA) the FAQ claims it's because sylphs are lightweight, but that only explains the first syllable"},{"name":"sympa","desc":"(mailinglist manager) the package description explains that a \"système de multi-postage automatique\" is an \"automatic multi-mailing system\", but not that \"sympa(thique)\" is French for \"nice, likeable\""},{"name":"sysvinit","desc":"the initialization daemon inherited from UNIX System V, which replaced UNIX System IV in 1983 (but the name of its successor systemd does not similarly represent \"UNIX System five hundred\"). The package contains telinit, which apparently means \"tell init\" (and confusingly is a symlink to init)"},{"name":"tailor","desc":"(ex-package) (inter-VCS changeset migrator) obvious once you realise it's dealing with patches"},{"name":"tali","desc":"formerly gtali short for GNOME Tali, from the Latin for \"anklebones\", since that's what the Romans used for dice"},{"name":"tang","desc":"an authentication system named after the projecting \"tang\" that's part of a lock"},{"name":"tar","desc":"originally for creating Tape ARchives"},{"name":"tcc","desc":"a Tiny C Compiler"},{"name":"tea","desc":"apparently it's a text editor of the atomic era"},{"name":"tellico","desc":"KDE collection-tracker; just from a placename near where the developer grew up (a controversial dam in Tennessee)"},{"name":"telnet","desc":"teletype network. Before the days of computer terminals, Teletype was originally a brand of \"telegraph typewriters\""},{"name":"texlive*","desc":"(typesetting system) the \"X\" in \"TeX\" is really a Greek \"χ\" (chi as in \"techne\" = art/skill/craft); the \"live\" is because it used to be possible to run upstream versions up to 2009 from a liveCD"},{"name":"tgif","desc":"antique drawing tool; the name has nothing to do with GIF format (or \"thank goodness it's Friday\") - it stands for \"Tangram Graphic Interface Facility\""},{"name":"thuban","desc":"(interactive geographic data viewer) Arabic for \"snake\", but presumably named after Thuban the once-and-future pole star (alpha Draconis)"},{"name":"timidity","desc":"software synthesizer (i.e. MIDI player), now known upstream as TiMidity++; not related to audacity"},{"name":"tmux","desc":"multiplexer for virtual consoles. terminal multiplexer."},{"name":"tokyotyrant","desc":"network-capable control interface to the tokyocabinet database management library, which is in turn apparently just named after the fact it's Japanese and contains things (likewise the new C++ version, kyotocabinet)"},{"name":"tomb","desc":"(directory encryption tool) a cobweb-covered pun on \"crypt\", as in \"underground burial vault\" not that there's anything secret about a crypt; it's just decently out of sight!"},{"name":"tomcat*","desc":"Java web server; an arbitrary animal name specifically chosen to get a tomcat onto the O'Reilly book cover"},{"name":"trove","desc":"(OpenStack DB-as-a-Service) a treasure-trove is a form of longterm storage for valuable stuff, albeit not one that's optimized for convenient access"},{"name":"tryton-*","desc":"enterprise application framework mainly written in Python. The name is a reference to the programming language and Triton, the largest moon of the planet Neptune, while the logo is a reference to the Triton (or Triturus), a kind of newt (Are we sure it isn't named directly after the Greek god, perhaps incorporating a hint at \"three-tier architecture\"?)"},{"name":"tumbler","desc":"Xfce thumbnailer, so named presumably just because it's a cut-down thumbnailer"},{"name":"tuskar-*","desc":"(ex-package) (OpenStack deployment manager) named (arbitrarily?) after an Irish offshore rock (and lighthouse)"},{"name":"*twisted*","desc":"(Python network server modules) originated as part of the \"Twisted Reality\" online interactive fiction system (VR gaming with Python and they didn't call it mudsnake?)"},{"name":"twm","desc":"officially the \"tab window manager\" (the idea being that windows with title bars look like folders with tabs), but originally in 1987 \"Tom la Strange's WM\""},{"name":"typo3","desc":"(ex-package) a webCMS named after a dataloss incident"},{"name":"u-boot","desc":"not built for PC architectures there's clearly a German pun lurking beneath the surface here, but the \"U\" indicates \"Universal\" (the same as in GRUB)"},{"name":"ucblogo","desc":"the version of Logo from the University of California, Berkeley. The name is not an acronym; it's from the Greek for \"word\" (since it does more than just numbercrunching)"},{"name":"udev","desc":"as with udisks, ulogd, upower and so on the \"U\" here stands for \"Userspace\" - though the \"user\" in question doesn't necessarily mean the real-life entity between keyboard and chair, just a process not running in kernelspace (i.e. anything from init down to advertising popups)"},{"name":"udhcpd","desc":"that's not a \"U\", it's a \"μ\" (compare udeb or usleep) - this is the micro Dynamic Host Configuration Protocol Daemon"},{"name":"ukolovnik","desc":"(ex-package) (PHP todo-list) \"úkolovnik\" is Czech for \"task manager\""},{"name":"ukui*","desc":"desktop for Ubuntu Kylin, a revamp of Kylin OS (named after the \"Chinese unicorn\")"},{"name":"undertaker","desc":"(code analysis tool) helps you deal with \"dead\" (unreachable) codeblocks"},{"name":"unixodbc-*","desc":"this is the UNIX(-compatible) implementation of the Open DataBase Connectivity interface, not, say, UNIX Objective Design By Contract, or indeed United Nations International X-ray Observatory Dynamic Brake Control"},{"name":"unoconv","desc":"a format-switcher, but it doesn't extract things from oconv format; it's for converting between the formats used by Open/LibreOffice applications, all of which are built around the Universal Network Objects component model (Just don't ask me what that means or why end-users are supposed to care)"},{"name":"uruk","desc":"(firewall) named after the strong-walled Mesopotamian city of which Gilgamesh was king likely origin of the name \"Iraq\"; not after the Black Speech for \"orc\" in Tolkien"},{"name":"uswsusp","desc":"originally, userland (but is that \"saving the state of the complete desktop session\" or \"manipulated from userspace\"?) software (as in, using ACPI rather than relying on special motherboard features) suspend (meaning both standby-to-RAM and hibernate-to-disk functionality) - but these days different sources interpret the initial letter either as \"u\"-for-Userspace or as \"μ\"-for-Micro"},{"name":"util-linux","desc":"a package with a misleadingly straightforward name. In fact it's essential/required even on Debian GNU/kFreeBSD, and it contains some utilities with outstandingly cryptic names: cytune: [no longer included] for tuning Cyclades-Z multiport serial cards, as used in nineties ISPs dmesg: displays kernel ring buffer messages agetty: \"alternative get teletype\", which is in fact the standard console login handler mkfs.bfs: a tool for creating SCO UnixWare boot file systems, useful because... EXCUSE NOT FOUND"},{"name":"uudeview","desc":"named after one of its binaries, a command line uuencode format decoder/viewer dating back to the era of UUCP (Unix to Unix CoPy) connections; the package also contains similar utilities for some less ancient MIME-like encodings"},{"name":"valac","desc":"compiler for the Vala programming language. There's no official explanation for the name, but the leading theory is that it's a Tolkien reference"},{"name":"valentina","desc":"a clothes design tool named after famous Ukrainian-emigree fashion designer Valentina Nicholaevna Sanina Schlee"},{"name":"valgrind","desc":"Code profiler, but not a \"value-grinder\" (despite the thematic names of its executables). It was originally going to be named Heimdal, but since that was taken they just switched to a different name from Norse myth. Valgrind was the magically protected gateway into Valhalla"},{"name":"valinor","desc":"ELF debugging tool, and punning Tolkien reference (the Undying Lands that most elves have fled to)"},{"name":"vamps","desc":"(DVD-ripper) allegedly because it evaporates DVD-compliant MPEG2 program streams"},{"name":"vcsh","desc":"version control shell or vcs home"},{"name":"verdigris","desc":"Qt header library inspired by CopperSpice (for C++ aka cpp)"},{"name":"vidalia","desc":"(ex-package) a GUI for TOR (The Onion Router) named after a kind of onion (state vegetable of Georgia)"},{"name":"vile","desc":"when it says it's a \"VI Like Emacs\", it means that it's a vi clone which is relatively similar to emacs, and not the reverse, a \"vi-like emacs\". Compare zile and the following"},{"name":"vim","desc":"\"vi improved\", just as nvi is \"new\" and elvis is... a word with \"vi\" in the middle. In all these, \"vi\" indicates \"visual mode\" - that is, letting you see the text you're modifying in a full-console display, which had hitherto been an optional extra"},{"name":"vinagre","desc":"GNOME Remote Desktop/VNC client; named after the Spanish word for vinegar, because vino was taken"},{"name":"vlc","desc":"VideoLAN project media-player Client"},{"name":"w3m","desc":"(the text pager that thinks it's a tabbed graphical web browser) \"WWW-o miru\" is Japanese for \"see the World Wide Web\""},{"name":"wajig","desc":"(omnibus sysadmin wrapper command) sounds like an obvious hybrid of \"whatsit\", \"oojah\", and \"thingmajig\", natural enough for a general-purpose \"thingy\" command; but the docs insist it's the English word \"jig\" plus a prefix \"wa\" (Japanese for \"harmony\" or \"team spirit\"). If you say so..."},{"name":"wapiti","desc":"a web app probing tool, which starts out promisingly but ends up as just another free software ungulate"},{"name":"warmux","desc":"formerly wormux, which was presumably \"Worms clone for Linux\", though it's multi-platform and features no actual worms; renamed to avoid confusion and/or litigation. Now canonically capitalized as \"WarMUX\", though there's no sign of any multiplexing either"},{"name":"wayland*","desc":"compositing display server to rival X11; named after a town in Massachusetts (not particularly close to Plymouth) that the developer happened to be passing through"},{"name":"wcc","desc":"the Witchcraft Compiler Collection (performing \"binary black magic\")"},{"name":"weboob","desc":"(ex-package) web outside of browsers, with a childish pun on “boobs”"},{"name":"weechat","desc":"a more-or-less-recursive acronym:  Wee Enhanced Environment for Chat"},{"name":"whalebuilder","desc":"a tool based on pbuilder but using docker, the logo for which is \"Moby Dock\", a whale disguised as a container ship"},{"name":"whiptail","desc":"a dialog system using libnewt and named after a type of lizard (since newts are... almost lizards). \"Not Erik's Windowing Toolkit\" is a UI library based in turn on S-Lang; and \"slang\" happens to be Dutch for \"snake\", though it was intended to indicate that it started as a Stack-based Language."},{"name":"wicd-*","desc":"originally the Wireless Interface Connection Daemon, but since it now also handles wired networks it's officially meaningless"},{"name":"wine","desc":"originally short for WINdows Emulator, but \"corrected\" to Wine Is Not an Emulator"},{"name":"wiredtiger","desc":"given that it's a Big Data storage platform, it's more likely to be intended to suggest \"cool and fearsomely powerful thing on the network\" rather than \"as stable as a wildcat on amphetamines\""},{"name":"wireshark","desc":"this package obviously provides a filigree selachian. Either that or when ethereal got renamed they thought \"what way of indicating that it bites up network packets would be coolest and least likely to be trademarked?\" Despite the name it also works on wifi networks, and on dry land... (oh, and now there's also \"kernelshark\", so watch out Tux)"},{"name":"wmii","desc":"Window Manager Improved Improved, the successor of wmi (Window Manager Improved)"},{"name":"wodim","desc":"free fork of cdrecord for cdrkit (see also icedax); an approximate acronym for Write Optical DIsk Media, which is intelligible but hardly the first thing you'd guess (Frankly given that it handles Write-Once-Read-Many media I'm astonished it didn't get called \"iceworm\"...)"},{"name":"workrave","desc":"RSI preventer; the \"work\" part makes sense, but what's the \"rave\"? A dance party? A French turnip?"},{"name":"wvdial","desc":"upstream were formerly known as \"Worldvisions Weaver Software\", and parts of this package were known as \"weaver\", later abbreviated to just \"wv-\". Nothing to do with the package wv (where it's short for MSWordView)"},{"name":"wyrd","desc":"(simple calendar app) an unclaimed short word for \"that which is destined to happen\""},{"name":"x11-*","desc":"the eleventh major version of the X Window System (released in 1987; the minor version X11r7 came out in 2005). The X here isn't a type-2; it was originally intended to mark X as a successor to the W Window System developed for the V Operating System"},{"name":"*-xapian","desc":"a search engine based on code which went through various names with no obvious connection before it went proprietary; this is a free fork with an untrademarked name. It obviously has a type-2 \"X\" and an \"API\"; the FAQ admits that there's a vague pun on \"sapient\" in there too"},{"name":"xaw3dg","desc":"a library for X-consortium Athena widget-set three-dimensional graphics support, plus a \"G\" for glibc2 left over from the 1997 libc6 transition (yes, it's another product of Project Athena)"},{"name":"xawtv","desc":"originally an analog TV viewer based on XAW (as above)"},{"name":"xdg-*","desc":"some of these packages take the trouble to explain that they come from the FreeDesktop.Org standardization efforts, but not that XDG is short for its previous name, the \"X Desktop Group\" (a \"type-1\" X)"},{"name":"xemacs*","desc":"a fork of GNU Emacs, originally known as Lucid Emacs; when ownership of the Lucid Inc trademark became unclear it was renamed XEmacs, where the X is a \"type-2\""},{"name":"xen-*","desc":"designed for the \"Xenoserver Project\", where \"xeno-\" comes from the Greek word \"ξένος\" meaning \"foreigner\" or \"guest-friend\" (that is, a virtualized foreign OS that you allow to run on your server)"},{"name":"xfce*","desc":"stood for XForms Common Environment while that was accurate, but now doesn't stand for anything (and is thus even harder to distinguish from XKCD)"},{"name":"xindy","desc":"a LaTeX indexing tool; allegedly stands for \"fleXible INDexing sYstem\" (which deserves some sort of prize for onomastic obfuscation)"},{"name":"xiphos","desc":"a Bible-study system based on the SWORD project, and named after a variety of Ancient Greek sword (Is it significant that the xiphos was double-edged?)"},{"name":"xli","desc":"a longstanding fork of xloadimage (not derived by summing VI + X + X + XV)"},{"name":"xmms2","desc":"successor to XMMS, which was formerly \"X11Amp\" (that is, \"WinAmp clone for X11\"), but officially not a type-1: instead it's \"the cross-platform multimedia system\""},{"name":"xmount","desc":"a forensic tool where the X is neither type-1 nor type-2. Instead it's pronounced \"crossmount\" (meaning that it translates between disk image formats on the fly)"},{"name":"xnee","desc":"it may be an X event recorder/replayer, but Xnee's not an event emulator; and roughly the same goes for cnee, gnee, and pnee (in theory their initial letters don't stand for \"X11/console/Gnome/gnome-Panel\"...)"},{"name":"xorriso","desc":"a tool for creating .isos (putting an X/Open-compliant file system on a Rock-Ridge-enhanced ISO image), punning incidentally on \"sorriso\" (Portuguese for \"smile\") and accidentally on \"chorizo\" and \"xoriço\" (Spanish and Catalan for a kind of sausage) (The X/Open part is because it allows more than the POSIX standard. The Rock Ridge Interchange Protocol was so called as a Mel Brooks reference, riffing on the old High Sierra Format - which was named after a hotel.  And finally, the ISO-9660 standard comes from the International Organization for Standardization, which is abbreviated to \"ISO\" for hazy reasons)"},{"name":"xpra","desc":"provides X11 persistent remote applications - in other words, it's like a graphical screen for individual application windows on remote systems"},{"name":"xulrunner-*","desc":"(ex-package) a back-end for things made out of the Mozilla widget-building material known to acronym fans as XUL. That's a Ghostbusters reference as well as a standard piece of Mozilla-speak for \"XML UI Language\" (where XML is the \"eXtensible Markup Language\" and a UI is a \"User Interface\")"},{"name":"xxd","desc":"the name echoes that of \"uudecode\" (a conversion tool for an antique ASCII format - see uudeview), though in the case of xxd it's the fact it can encode hexdumps into binaries that sets it apart from the implementations with intelligible names"},{"name":"xygrib","desc":"a reader to meteorological data in GRIB format (GRIdded Binary or General Regularly-distributed Information in Binary form); forked from zygrib with a similarly arbitrary prefix"},{"name":"yabause","desc":"yet another buggy and uncomplete Saturn emulator (for the mid-nineties Sega Saturn games console) well, there's one bug already: that should be \"INcomplete\""},{"name":"yadifa","desc":"practically the only thing Wikipedia claims to know is the bit the docs don't mention: it's \"yet another DNS implementation for all\""},{"name":"yap","desc":"yet another Prolog"},{"name":"yard","desc":"yes, a Ruby documenter; but no, officially it stands for Yay! A Ruby documentation tool"},{"name":"yaws","desc":"yet another webserver"},{"name":"yelp","desc":"formerly gnome-help, now inexplicable. Did the word \"gelp\" get written in hard-to-decipher handwriting, or what?"},{"name":"yersinia","desc":"(network protocol security tester) named after the bacterium responsible for the black death not a virus, and not a virus-scanner"},{"name":"ytalk","desc":"Brett Yenne's version of BSD talk"},{"name":"zabbix-*","desc":"apparently if you take the zabbix.com training course it explains the name"},{"name":"zanshin","desc":"(KDE notetaking app) Japanese martial-arts term for \"relaxed awareness\""},{"name":"zapping","desc":"a lot of continental Europeans seem to think \"zapping\" is a cool English word for \"channel-hop\""},{"name":"zaqar-*","desc":"(OpenStack messaging service) formerly named Marconi, but renamed (for the usual trademark reasons) after the Mesopotamian dreamlord Zaqar/Dzakar, messenger of the moongod Sin"},{"name":"zathura","desc":"the box office flop sequel to Jumanji, which might make trademark-infringing amounts of sense if it was a game, but no, it's a document viewer"},{"name":"zemberek-*","desc":"(Turkic spellchecker) from the Turkish for \"mainspring\"; the FAQ used to claim it was because the developer came from a long line of watchmakers, but now it only says it sounds funny. Etymologically it's from the Persian for \"bee\", so let's just call it an arbitrary animal"},{"name":"zenity","desc":"(dialog tool) mysterious; presumably the connection with Zen Buddhism is just that it tries to be simple (not connected with the C++ ZenLib)"},{"name":"zfs*","desc":"the last word in file systems, if only alphabetically; originally the Zettabyte File System"},{"name":"zile","desc":"zile is lossy emacs - in the figurative sense of \"lossy\"; literally speaking, it isn't emacs at all, it's zile. Compare vile (but don't bother comparing file or kile)"},{"name":"zim","desc":"(personal wiki-notepad) unrelated to the ZIM (Zeno IMproved) file format used (e.g.) by the WikiMedia Foundation; the original logo makes it clear it's an Invader Zim reference"},{"name":"zlib1g","desc":"a compression library. This field has been associated with the letter \"Z\" since long before PKZip (1989); it may even predate the Lempel-Ziv 1977 algorithm. Back before the days of the LZW-based compress with its .Z extension, /bin/pack used Huffman codes and, for some reason, a .z extension. Oddly, zlib1g isn't the upstream or source package name (that's plain \"zlib\") or the name of the library it provides (that's \"libz1\"). The \"g\" is probably a hangover from the libc6 transition (which means it effectively stands for \"glibc2\")"},{"name":"zomg","desc":"(libre.fm client) well, it's implemented in zsh..."},{"name":"zope*","desc":"(webappserver) \"Z Object Publishing Environment\" (where the \"Z\" seems to be just because it's a cool letter)"},{"name":"zopfli","desc":"a compression tool, with the traditional \"Z\", named after a Swiss bakery product: \"Zopfli\" = \"little braid\". Compare brotli, butteraugli, and guetzli"},{"name":"zorp","desc":"this appears to be an arbitrary nonsense-syllable, and not (as one might have guessed) the Hungarian for \"zonealarm\""},{"name":"zotero-*","desc":"(ex-package) (bibliographical data-organizer) named from the Albanian verb \"zotëro\" meaning \"to master, acquire\""},{"name":"zsh","desc":"the Z shell, named because the developer had a colleague named Zhong Shao and thought his login \"zsh\" looked cool"},{"name":"zulucrypt","desc":"FS-encryption system so named just because the developer happened to hear the word"},{"name":"zypper","desc":"(PackageKit software management tool) uses Novell's libZYpp, which has a Z from their \"ZEN\" (\"zero effort networks\") and a Y from SuSE's \"YaST\" (\"yet another setup tool\")"},{"name":"zzuf","desc":"a source of \"fuzzing\", i.e. data corruption for application debugging, which started out with a much ruder name"}]